[
  {
    "title": "Nato corruption probe 'reminder' of defense boom risks",
    "link": "https://timesofindia.indiatimes.com/world/europe/nato-corruption-probe-reminder-of-defense-boom-risks/articleshow/121268623.cms",
    "description": "Nato's procurement agency faces scrutiny amid a corruption investigation involving staff and ex-staff, with detentions in Belgium and the Netherlands. The probe, initiated by Nato itself, focuses on irregularities in ammunition and drone contracts.",
    "pubDate": "2025-05-19T16:58:57+05:30",
    "fetched_at": "2025-05-19T11:35:11.985119+00:00"
  },
  {
    "title": "Apple iPhone 16 Pro is available for just Rs 62,605 on Amazon; know how to grab the deal",
    "link": "https://timesofindia.indiatimes.com/technology/mobiles-tabs/apple-iphone-16-pro-is-available-for-just-rs-62605-on-amazon-know-how-to-grab-the-deal/articleshow/121268486.cms",
    "description": "Apple's Glowtime event unveiled the iPhone 16 series, featuring four models with a minimum of 128GB storage. In India, prices start at Rs 79,900 for the iPhone 16 and reach Rs 1,44,900 for the iPhone 16 Pro Max. Amazon offers exchange programs, potentially reducing the iPhone 16 Pro's price to Rs 62,505 with trade-ins and bank offers.",
    "pubDate": "2025-05-19T16:57:09+05:30",
    "fetched_at": "2025-05-19T11:35:11.985131+00:00"
  },
  {
    "title": "Godzilla rumors spark frenzy as Fortnite Creative could host the Kaiju icon",
    "link": "https://timesofindia.indiatimes.com/sports/esports/fortnite/godzilla-rumors-spark-frenzy-as-fortnite-creative-could-host-the-kaiju-icon/articleshow/121268674.cms",
    "description": "Leaked information suggests Godzilla may return to Fortnite, potentially shaking up Creative mode. Players might gain access to Godzilla-like gameplay elements for custom maps and mini-games. While some fans desire new collaborations, others are excited about the possibilities, envisioning large-scale kaiju battles and the integration of iconic IPs into user-generated content.",
    "pubDate": "2025-05-19T16:55:48+05:30",
    "fetched_at": "2025-05-19T11:35:11.985136+00:00"
  },
  {
    "title": "Copper-legged blue frog from poison dart family discovered in the Amazon rainforest",
    "link": "https://timesofindia.indiatimes.com/science/copper-legged-blue-frog-from-poison-dart-family-discovered-in-the-amazon-rainforest/articleshow/121268373.cms",
    "description": "A vibrant blue poison dart frog, *Ranitomeya aetherea*, has been identified as a new species in the western Amazon. Discovered near the Juruá River, this frog boasts striking copper highlights on its limbs and distinctive pale blue stripes. Its unique call patterns and specific habitat preferences make it a significant find, highlighting the vulnerability of such species to environmental changes.",
    "pubDate": "2025-05-19T16:53:28+05:30",
    "fetched_at": "2025-05-19T11:25:10.362472+00:00"
  },
  {
    "title": "Modern Indian youth prioritise career and values, survey finds",
    "link": "https://timesofindia.indiatimes.com/life-style/relationships/love-sex/modern-indian-youth-favor-career-aspirations-over-relationships/articleshow/121268257.cms",
    "description": "A recent survey by QuackQuack reveals a shift in relationship priorities among Indian youth. Career goals and personal values are now paramount, with many preferring singlehood over settling. Emotional stability and mutual respect are highly valued, even in tier 2 and 3 cities. Independence and emotional maturity are key expectations, highlighting a move towards compatibility and growth.",
    "pubDate": "2025-05-19T16:52:54+05:30",
    "fetched_at": "2025-05-19T11:25:10.362503+00:00"
  },
  {
    "title": "Bengaluru's reality after heavy downpour: Farewell roads, hello rafts",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/bangalore/bengalurus-reality-after-heavy-downpour-farewell-roads-hello-rafts/articleshow/121267926.cms",
    "description": "Waterlogging across Bengaluru, following heavy rainfall, led to unusual scenes of residents using rafts for transportation.",
    "pubDate": "2025-05-19T16:51:01+05:30",
    "fetched_at": "2025-05-19T11:25:10.362526+00:00"
  },
  {
    "title": "Want to earn like Sundar Pichai, with Rs 5 crores a day? Here's the surprising wealth advice from Thyrocare's billionaire founder",
    "link": "https://timesofindia.indiatimes.com/technology/social/want-to-earn-like-sundar-pichai-with-rs-5-crores-a-day-heres-the-surprising-wealth-advice-from-thyrocares-billionaire-founder/articleshow/121268412.cms",
    "description": "Dr. A. Velumani challenges the notion that entrepreneurship is the sole path to wealth, citing Sundar Pichai's corporate success as an example. He argues that high-level corporate leadership can be as financially rewarding as starting a business, with less risk. Velumani advises aspiring wealth-makers to consider corporate roles, emphasizing the stability and potential for long-term wealth creation within established companies.",
    "pubDate": "2025-05-19T16:49:00+05:30",
    "fetched_at": "2025-05-19T11:25:10.362510+00:00"
  },
  {
    "title": "'Good for jobs, bills and borders': UK and EU agree on landmark security and defence pact",
    "link": "https://timesofindia.indiatimes.com/world/uk/good-for-jobs-bills-and-borders-uk-and-eu-agree-on-landmark-security-and-defence-pact/articleshow/121268533.cms",
    "description": "Britain and the European Union have forged a new security and defence partnership, enabling closer collaboration amidst escalating global threats. The agreement allows the UK defence industry to participate in the EU’s €150 billion Security Action for Europe (SAFE) fund, potentially supporting thousands of British jobs.",
    "pubDate": "2025-05-19T16:47:46+05:30",
    "fetched_at": "2025-05-19T11:25:10.362514+00:00"
  },
  {
    "title": "RJ Mahvash on her bond with Yuzvendra Chahal – THIS is what she likes the most about the cricketer",
    "link": "https://timesofindia.indiatimes.com/life-style/relationships/love-sex/rj-mahvash-on-her-bond-with-yuzvendra-chahal-this-is-what-she-likes-the-most-about-the-cricketer/articleshow/121268509.cms",
    "description": "Rumors of a romance between Indian cricketer Yuzvendra Chahal and RJ Mahvash continue to swirl, fueled by their public appearances and social media interactions. Mahvash recently praised Chahal's kindness and humility, further igniting speculation. This comes after Chahal's divorce earlier this year, coinciding with increased sightings of him and Mahvash together, leading fans to closely watch their evolving relationship.",
    "pubDate": "2025-05-19T16:46:14+05:30",
    "fetched_at": "2025-05-19T11:25:10.362520+00:00"
  },
  {
    "title": "\"It’s more important than BBC”: Gary Lineker taken off BBC's FIFA 2026 coverage following pro-Palestine Instagram row",
    "link": "https://timesofindia.indiatimes.com/sports/football/news/its-more-important-than-bbc-gary-lineker-taken-off-bbcs-fifa-2026-coverage-following-pro-palestine-instagram-row/articleshow/121268201.cms",
    "description": "Gary Lineker, a prominent BBC presenter and former England footballer, is set to depart from his role after 26 years due to a controversy sparked by a pro-Palestine social media post. The post drew criticism and accusations of antisemitism. Lineker's exit, accelerated by a year, concludes with his final 'Match of the Day' appearance this Sunday.",
    "pubDate": "2025-05-19T16:43:23+05:30",
    "fetched_at": "2025-05-19T11:18:08.683267+00:00"
  },
  {
    "title": "Stunning photos of the Sunflower Galaxy caught on camera",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/stunning-photos-of-the-sunflower-galaxy-caught-on-camera/articleshow/121267477.cms",
    "description": "NASA's Hubble Space Telescope reveals a detailed image of Messier 63. It is also known as the Sunflower Galaxy. The galaxy is 27 million light-years away in Canes Venatici. Astronomers study its flocculent spiral structure. They are testing theories of star formation. Amateur astrophotographers also capture its beauty. Future James Webb Space Telescope observations will explore star and planet formation.",
    "pubDate": "2025-05-19T16:40:46+05:30",
    "fetched_at": "2025-05-19T11:35:11.985102+00:00"
  },
  {
    "title": "Godrej Properties expands land bank across India, taps Rs 26,500 crore potential through 14 land parcels",
    "link": "https://timesofindia.indiatimes.com/business/india-business/godrej-properties-expands-land-bank-across-india-taps-rs-26500-crore-potential-through-14-land-parcels/articleshow/121267272.cms",
    "description": "Godrej Properties expands land bank across India, taps Rs 26,500 crore potential through 14 land parcels",
    "pubDate": "2025-05-19T16:37:30+05:30",
    "fetched_at": "2025-05-19T11:10:07.350666+00:00"
  },
  {
    "title": "Calcutta High Court upholds artistes’ right to work in Tollywood",
    "link": "https://timesofindia.indiatimes.com/entertainment/bengali/movies/news/calcutta-high-court-upholds-artistes-right-to-work-in-tollywood/articleshow/121268320.cms",
    "description": "Calcutta High Court upholds artistes’ right to work in Tollywood",
    "pubDate": "2025-05-19T16:37:02+05:30",
    "fetched_at": "2025-05-19T11:10:07.350674+00:00"
  },
  {
    "title": "Why are environmental protesters being criminalized?",
    "link": "https://timesofindia.indiatimes.com/home/environment/global-warming/why-are-environmental-protesters-being-criminalized/articleshow/121268364.cms",
    "description": "Climate activists globally face harsh penalties for protesting. Australia has high arrest rates for environmental protests. New laws target disruptions with hefty fines and jail time. The UK and Germany also see increased legal action against protesters. Fossil fuel companies use lawsuits to silence dissent. Activists face murder in some regions. These actions reflect growing intolerance towards climate activism.",
    "pubDate": "2025-05-19T16:36:46+05:30",
    "fetched_at": "2025-05-19T11:10:07.350678+00:00"
  },
  {
    "title": "Why are environmental protesters being criminalized?",
    "link": "https://timesofindia.indiatimes.com/world/europe/why-are-environmental-protesters-being-criminalized/articleshow/121267996.cms",
    "description": "Climate activists globally face harsh penalties for protesting. Australia has high arrest rates for environmental protests. New laws target disruptions with hefty fines and jail time. The UK and Germany also see increased legal action against protesters. Fossil fuel companies use lawsuits to silence dissent. Activists face murder in some regions. These actions reflect growing intolerance towards climate activism.",
    "pubDate": "2025-05-19T16:36:43+05:30",
    "fetched_at": "2025-05-19T11:10:07.350676+00:00"
  },
  {
    "title": "Supriya Shukla on essaying Indrani in Ufff… Yeh Love Hai Mushkil: I wake up excited to shoot every day",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/supriya-shukla-on-essaying-indrani-in-ufff-yeh-love-hai-mushkil-i-wake-up-excited-to-shoot-every-day/articleshow/121268363.cms",
    "description": "Supriya Shukla, known for her TV mom roles, is set to star in 'Ufff… Yeh Love Hai Mushkil' as Indrani, a spirited and complex mother. She expresses excitement about the role's depth and working with Shabir Ahluwalia again.",
    "pubDate": "2025-05-19T16:36:37+05:30",
    "fetched_at": "2025-05-19T11:35:11.985114+00:00"
  },
  {
    "title": "Wrong Map Controversy: Why Indians are furious with YouTube channel Real Engineering's Isro video",
    "link": "https://timesofindia.indiatimes.com/science/wrong-map-controversy-why-indians-are-furious-with-real-engineers-isro-video/articleshow/121267417.cms",
    "description": "Real Engineering's video about Isro faced criticism in India. The issue arose from an inaccurate map depicting India's borders. Indian viewers expressed outrage over the disrespect to the nation's territorial integrity. The channel's response and subsequent comments further fuelled the controversy. The incident highlights the importance of geopolitical sensitivity when discussing other countries.",
    "pubDate": "2025-05-19T16:35:33+05:30",
    "fetched_at": "2025-05-19T11:10:07.350696+00:00"
  },
  {
    "title": "\"Marchand is a loser\": Leafs' fans heckled a man in Brad Marchand's jersey before Game 7 in Toronto",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/marchand-is-a-loser-leafs-fans-heckled-a-man-in-brad-marchands-jersey-before-game-7-in-toronto/articleshow/121268244.cms",
    "description": "Before Game 7 between the Florida Panthers and Toronto Maple Leafs, a video surfaced of a man in a Brad Marchand jersey being heckled by Leafs fans in Toronto. Despite the taunts, the Panthers won, leading to fans mocking the hecklers. Marchand himself acknowledged the Maple Leafs' improved competitiveness in a post-game interview.",
    "pubDate": "2025-05-19T16:32:33+05:30",
    "fetched_at": "2025-05-19T11:35:11.985108+00:00"
  },
  {
    "title": "Global markets tumble as Moody’s downgrades US credit rating amid rising debt concerns",
    "link": "https://timesofindia.indiatimes.com/business/international-business/global-markets-today-ftse-100-dax-asian-markets-sp-500-moodys-downgrades-us-credit-rating/articleshow/121268232.cms",
    "description": "Global stock markets faced a downturn after Moody's Ratings downgraded the United States' credit rating. This news impacted US futures and the dollar. European and Asian markets also experienced declines. China's economic data revealed slower growth in retail sales and industrial output. Oil prices weakened. This sell-off occurred after a strong week on Wall Street.",
    "pubDate": "2025-05-19T16:30:30+05:30",
    "fetched_at": "2025-05-19T11:10:07.350682+00:00"
  },
  {
    "title": "Explore the 10 weirdest snakes in the world including dragon snakes, flying snakes and more",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/explore-the-10-weirdest-snakes-in-the-world-including-dragon-snakes-flying-snakes-and-more/articleshow/121266888.cms",
    "description": "From tentacled snakes with unique sensory organs to flying snakes that glide through the air, the world is home to some truly bizarre snake species. The dragon snake's keeled scales and the hairy bush viper's spiky appearance add to the oddities. Rattlesnakes use their iconic rattle for defense, while vine snakes possess keyhole-shaped pupils for exceptional vision.",
    "pubDate": "2025-05-19T16:28:51+05:30",
    "fetched_at": "2025-05-19T11:10:07.350693+00:00"
  },
  {
    "title": "Rights under constant attack in Taliban-ruled Afghanistan",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/rights-under-constant-attack-in-taliban-ruled-afghanistan/articleshow/121267349.cms",
    "description": "A UN report reveals escalating human rights violations in Afghanistan under Taliban rule, including persecution of the Ismaili community and forced conversions. Women face systematic oppression, with girls barred from education. Despite the crisis, Afghans are being deported from neighboring countries, exacerbating the socioeconomic collapse where a majority live in poverty and depend on aid.",
    "pubDate": "2025-05-19T16:25:52+05:30",
    "fetched_at": "2025-05-19T11:01:05.654422+00:00"
  },
  {
    "title": "Exclusive - Dalljiet Kaur changes her name on her Instagram profile; adds her mother's name; says 'she has been the biggest strength'",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/exclusive-dalljiet-kaur-changes-her-name-on-her-instagram-profile-adds-her-mothers-name-says-she-has-been-the-biggest-strength/articleshow/121268150.cms",
    "description": "Dalljiet Kaur honored her mother, Prietam, by adding her name to her Instagram profile as Dalljiet Prietam Kaur on Mother's Day. This gesture reflects her deep appreciation for her mother's unwavering support and strength throughout her life. Dalljiet acknowledged her mother's significant role in guiding and protecting her, especially during challenging times.",
    "pubDate": "2025-05-19T16:25:07+05:30",
    "fetched_at": "2025-05-19T11:01:05.654419+00:00"
  },
  {
    "title": "It may not all be looking well for Apple's AI ambitions",
    "link": "https://timesofindia.indiatimes.com/technology/tech-news/it-may-not-all-be-looking-well-for-apples-ai-ambitions/articleshow/121267891.cms",
    "description": "Apple's AI ambitions face significant hurdles, seven years after hiring Google's AI chief. Plagued by delayed features, internal strife, and technical challenges, Apple Intelligence lags behind competitors like OpenAI. Leadership shuffles and concerns over accuracy have prompted a shift in strategy, focusing on existing capabilities amid fears of losing ground in the rapidly evolving AI landscape.",
    "pubDate": "2025-05-19T16:22:02+05:30",
    "fetched_at": "2025-05-19T11:01:05.654425+00:00"
  },
  {
    "title": "Yusuf Pathan opts out of all-party delegation; TMC says 'Centre can't unilaterally decide'",
    "link": "https://timesofindia.indiatimes.com/india/yusuf-pathan-opts-out-of-all-party-delegation-tmc-says-centre-cant-unilaterally-decide/articleshow/121267404.cms",
    "description": "TMC MP Yusuf Pathan withdrew from the all-party delegation after the Centre's \"unilateral\" selection, sparking criticism from TMC leaders Mamata Banerjee and Abhishek Banerjee, who emphasized the party's right to choose its representative. Congress also questioned the Centre's selection process, deeming it \"dishonest\" after its suggested names were rejected.",
    "pubDate": "2025-05-19T16:20:19+05:30",
    "fetched_at": "2025-05-19T11:01:05.654428+00:00"
  },
  {
    "title": "7 benefits of having a spoonful of desi ghee with dal in summers",
    "link": "https://timesofindia.indiatimes.com/life-style/food-news/7-benefits-of-having-a-spoonful-of-desi-ghee-with-dal-in-summers/articleshow/121267693.cms",
    "description": "Ghee, a staple in Indian cuisine, offers numerous health benefits beyond its culinary uses. Contrary to common belief, Ayurveda suggests that moderate ghee consumption during summer aids nutrient absorption, provides sustained energy, lubricates joints, enhances immunity, and promotes skin health. Its cooling properties help manage body heat and prevent dehydration, making it a valuable addition to the summer diet.",
    "pubDate": "2025-05-19T16:19:55+05:30",
    "fetched_at": "2025-05-19T10:50:04.158982+00:00"
  },
  {
    "title": "Mango Mania: rising demand and popularity across India this summer",
    "link": "https://timesofindia.indiatimes.com/life-style/spotlight/mango-fever-unprecedented-demand-for-mangoes-across-india-this-summer/articleshow/121267980.cms",
    "description": "This summer witnessed a significant surge in mango demand across India, driven by both metro and tier 2 cities. Bengaluru led in overall sales, with regional favorites like Sindhura, Totapuri, Banganapalli, and Alphonso dominating specific markets. Mango-flavored products also experienced a notable rise, with quick delivery services ensuring freshness and convenience for consumers nationwide, leading to high repeat purchase rates.",
    "pubDate": "2025-05-19T16:19:27+05:30",
    "fetched_at": "2025-05-19T10:50:04.158958+00:00"
  },
  {
    "title": "Watch video: Baby orangutans Christopher and Stefan rescued amid illegal wildlife smuggling in Thailand",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/watch-video-baby-orangutans-christopher-and-stefan-rescued-amid-illegal-wildlife-smuggling-in-thailand/articleshow/121267496.cms",
    "description": "Thai authorities in Bangkok apprehended a man attempting to smuggle two baby orangutans, one just a month old, at a fuel station. The suspect faces charges for illegal possession of protected wildlife, with investigations underway to determine the origin of the orangutans and potential links to a larger international trafficking operation.",
    "pubDate": "2025-05-19T16:16:25+05:30",
    "fetched_at": "2025-05-19T11:10:07.350688+00:00"
  },
  {
    "title": "Jannik Sinner loses the Italian Open final, but the real blow came from his brother’s absence",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/jannik-sinner-loses-the-italian-open-final-but-the-real-blow-came-from-his-brothers-absence/articleshow/121267713.cms",
    "description": "Jannik Sinner, despite losing the Italian Open final to Carlos Alcaraz, humorously called out his brother for attending the Formula 1 race in Imola instead of supporting him in Rome. Sinner, back after a three-month break, acknowledged Alcaraz's victory and his own team's efforts. He also celebrated the success of Italian tennis, highlighting Jasmine Paolini's wins.",
    "pubDate": "2025-05-19T16:15:31+05:30",
    "fetched_at": "2025-05-19T10:50:04.158976+00:00"
  },
  {
    "title": "UEFA confirms Spain vs Argentina Finalissima with Lionel Messi vs Lamine Yamal clash",
    "link": "https://timesofindia.indiatimes.com/sports/football/news/uefa-confirms-spain-vs-argentina-finalissima-with-lionel-messi-vs-lamine-yamal-clash/articleshow/121266576.cms",
    "description": "UEFA and CONMEBOL have announced that Euro 2024 champions Spain will face Copa América 2024 winners Argentina in Finalissima 2025. The match is billed as a generational clash between teen sensation Lamine Yamal and legend Lionel Messi. The game could also influence the 2025 Ballon d'Or race, with Yamal and Barcelona teammate Raphinha in contention.",
    "pubDate": "2025-05-19T16:14:36+05:30",
    "fetched_at": "2025-05-19T10:50:04.158979+00:00"
  },
  {
    "title": "'Absolute lie': Congress slams government for denying communication over all-party delegation names",
    "link": "https://timesofindia.indiatimes.com/india/absolute-lie-congress-slams-government-for-denying-communication-over-all-party-delegation-names/articleshow/121267812.cms",
    "description": "'Absolute lie': Congress slams government for denying communication over all-party delegation names",
    "pubDate": "2025-05-19T16:12:18+05:30",
    "fetched_at": "2025-05-19T10:50:04.158984+00:00"
  },
  {
    "title": "Who is Jamal Roberts? Meet the 2025 American Idol winner, know about his family, and inspiring journey",
    "link": "https://timesofindia.indiatimes.com/world/us/who-is-jamal-roberts-meet-the-2025-american-idol-winner-know-about-his-family-and-his-inspiring-journey/articleshow/121267263.cms",
    "description": "Jamal Roberts, a physical education teacher from Mississippi, made history by winning the 23rd season of American Idol, becoming the first black man to claim the title in 22 years. Garnering 26 million votes, his victory follows Ruben Studdard's 2003 win, highlighting his exceptional talent and the evolving landscape of American music.",
    "pubDate": "2025-05-19T16:11:52+05:30",
    "fetched_at": "2025-05-19T10:43:01.670738+00:00"
  },
  {
    "title": "'Chidiya' trailer unveils a poignant tale of dreams, resilience, and joy amid scarcity",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/chidiya-trailer-unveils-a-poignant-tale-of-dreams-resilience-and-joy-amid-scarcity/articleshow/121267744.cms",
    "description": "The film Chidiya is set to release on May 30, 2025. It stars Vinay Pathak and Amruta Subhash. The film is about two brothers in Mumbai with big dreams. They turn a junkyard into a badminton court. This brings the community together. The film has won awards at international film festivals.",
    "pubDate": "2025-05-19T16:11:27+05:30",
    "fetched_at": "2025-05-19T10:43:01.670783+00:00"
  },
  {
    "title": "Fresh hope for fans as sports minister talks about Lionel Messi’s Kerala visit",
    "link": "https://timesofindia.indiatimes.com/sports/football/news/fresh-hope-for-fans-as-sports-minister-talks-about-lionel-messis-kerala-visit/articleshow/121267799.cms",
    "description": "Kerala's football fans are excited. Sports Minister V. Abdurahiman announced Lionel Messi might visit in 2025. A Kochi company is working with Argentina's team for friendly matches. Money issues are being resolved with new sponsors. The government is providing support for permissions and safety. Fans are thrilled at the prospect of seeing Messi play in Kerala.",
    "pubDate": "2025-05-19T16:09:09+05:30",
    "fetched_at": "2025-05-19T11:10:07.350691+00:00"
  },
  {
    "title": "Naseeruddin Shah recalls doing three shifts a day for money: 'There is no worse torture'",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/naseeruddin-shah-recalls-doing-three-shifts-a-day-for-money-there-is-no-worse-torture/articleshow/121267647.cms",
    "description": "Naseeruddin Shah confessed to taking on roles solely for financial reasons early in his career, a decision he now regrets due to the grueling schedule and superficiality. Ratna Pathak Shah, while acknowledging her work's varying quality, emphasizes the importance of dedication in every role.",
    "pubDate": "2025-05-19T16:08:40+05:30",
    "fetched_at": "2025-05-19T10:43:01.670777+00:00"
  },
  {
    "title": "Disco lips are back and how!",
    "link": "https://timesofindia.indiatimes.com/life-style/beauty/get-ready-for-the-glitter-disco-lips-of-disco-era-make-a-glamorous-comeback-lady-gaga-miley-cyrus-try-the-beauty-trend/articleshow/121266889.cms",
    "description": "Disco lips, characterised by glitter, gloss, and shimmer, are making a vibrant comeback, fueled by a desire for texture and fun. Originating from the 1970s disco era and queer culture's bold self-expression, this trend is now embraced by celebrities and luxury brands as well",
    "pubDate": "2025-05-19T16:08:10+05:30",
    "fetched_at": "2025-05-19T10:43:01.670794+00:00"
  },
  {
    "title": "Wayne Gretzky’s daughter Paulina Gretzky stuns fans with bold new photoshoot amid PGA Championship appearance",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/wayne-gretzkys-daughter-paulina-gretzky-stuns-fans-with-bold-new-photoshoot-amid-pga-championship-appearance/articleshow/121267507.cms",
    "description": "Paulina Gretzky, daughter of Wayne Gretzky, has captivated fans with a bold photoshoot shared on social media. The images, featuring her in jeans and strategically posed, have garnered widespread admiration. This post comes after her appearance at the PGA Championship with husband Dustin Johnson and following Wayne Gretzky's recent public appearances after the 4 Nations' controversy.",
    "pubDate": "2025-05-19T16:07:27+05:30",
    "fetched_at": "2025-05-19T11:10:07.350690+00:00"
  },
  {
    "title": "Maharashtra MPSC Group B prelims result 2025 declared on mpsc.gov.in; 8179 candidates shortlisted for mains",
    "link": "https://timesofindia.indiatimes.com/education/news/maharashtra-mpsc-group-b-prelims-result-2025-declared-on-mpsc-gov-in-8179-candidates-shortlisted-for-mains/articleshow/121267483.cms",
    "description": "The Maharashtra Public Service Commission (MPSC) has declared the Group B Preliminary Examination 2025 results on May 19, 2025. A total of 8179 candidates have qualified for the mains examination to fill 480 vacancies across posts like ASO, PSI, STI, and Sub Registrar. The result and cutoff marks are available in PDF format on the official website. Qualified candidates must apply and pay the fee within the deadline to proceed to the next stage.",
    "pubDate": "2025-05-19T16:06:43+05:30",
    "fetched_at": "2025-05-19T10:43:01.670799+00:00"
  },
  {
    "title": "Giannis Antetokounmpo of the Milwaukee Bucks has an unconventional answer to the NBA GOAT debate",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/giannis-antetokounmpo-of-the-milwaukee-bucks-has-an-unconventional-answer-to-the-nba-goat-debate/articleshow/121267498.cms",
    "description": "Giannis Antetokounmpo chooses to play it safe in the NBA GOAT debate during a recent Twitter Q&A with fans. But he chooses to keep things open ended, meaning, while MJ and Bron are for now the leading names, things could change in the future.",
    "pubDate": "2025-05-19T16:06:35+05:30",
    "fetched_at": "2025-05-19T10:43:01.670772+00:00"
  },
  {
    "title": "Lionel Messi breaks silence on MLS future and contract renewal status",
    "link": "https://timesofindia.indiatimes.com/sports/football/news/lionel-messi-breaks-silence-on-mls-future-and-contract-renewal-status/articleshow/121267640.cms",
    "description": "Lionel Messi's future with Inter Miami remains uncertain as his current contract nears its end in 2025. While Messi curtly addressed renewal speculations, Inter Miami's management expresses optimism about a possible extension, emphasizing its significance for the club and MLS.",
    "pubDate": "2025-05-19T16:05:46+05:30",
    "fetched_at": "2025-05-19T10:43:01.670820+00:00"
  },
  {
    "title": "LLRM Medical College hosts CME program on Pediatric Cardiology in Meerut",
    "link": "https://timesofindia.indiatimes.com/city/meerut/llrm-medical-college-hosts-cme-program-on-pediatric-cardiology-in-meerut/articleshow/121267353.cms",
    "description": "A CME program on Pediatric Cardiology convened at Lala Lajpat Rai Memorial Medical College, Meerut, spotlighting advancements in diagnosing and treating children's heart ailments. Chaired by Dr. Munesh Tomar, the symposium featured Prof. Anita Saxena's keynote on clinical approaches and Prof. Saurabh Gupta's insights on heart failure management. Discussions encompassed pediatric cardiac management, PPHN strategies, and Kawasaki Disease updates. Dr.",
    "pubDate": "2025-05-19T16:05:28+05:30",
    "fetched_at": "2025-05-19T10:43:01.670805+00:00"
  },
  {
    "title": "Inside Nayanthara and Vignesh Shivan’s luxe mid-air vacation with their twin boys",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/inside-nayanthara-and-vignesh-shivans-luxe-mid-air-vacation-with-their-twin-boys/articleshow/121267622.cms",
    "description": "Nayanthara and Vignesh Shivan recently shared heartwarming moments from their family vacation, showcasing their close bond with twin sons Uyir and Ulag. Vignesh expressed deep admiration for Nayanthara's ability to balance her career and motherhood gracefully.",
    "pubDate": "2025-05-19T16:05:26+05:30",
    "fetched_at": "2025-05-19T10:43:01.670811+00:00"
  },
  {
    "title": "Pascal Wehrlein reacts to 2nd place finish at Tokyo E-Prix Round 9: “Not super happy, but not very disappointed”",
    "link": "https://timesofindia.indiatimes.com/sports/formula-e/pascal-wehrlein-reacts-to-2nd-place-finish-at-tokyo-e-prix-round-9-not-super-happy-but-not-very-disappointed/articleshow/121267563.cms",
    "description": "Pascal Wehrlein, despite securing second place at the Tokyo E-Prix, expressed disappointment, feeling a win was within reach. He acknowledged Oliver Rowland's strong performance and the impact of a late safety car. Wehrlein's focus remains on maximizing each race, rather than solely chasing championship points, though he currently holds second position in the standings with 84 points.",
    "pubDate": "2025-05-19T16:05:15+05:30",
    "fetched_at": "2025-05-19T10:43:01.670826+00:00"
  },
  {
    "title": "Haryana espionage suspect says Pakistan 'paid him to click photos' of Sirsa airbase",
    "link": "https://timesofindia.indiatimes.com/india/haryana-espionage-suspect-says-pakistan-paid-him-to-click-photos-of-sirsa-airbase/articleshow/121266709.cms",
    "description": "Haryana Police arrested Mohammad Tarif for allegedly spying for Pakistan, the second such arrest in Nuh within 48 hours. Tarif confessed to photographing the Sirsa airbase and interacting with Pakistani officials, who recruited him at the Pakistan High Commission in Delhi. He faces charges under the Official Secrets Act, along with two Pakistani officials.",
    "pubDate": "2025-05-19T16:02:57+05:30",
    "fetched_at": "2025-05-19T10:35:00.208797+00:00"
  },
  {
    "title": "'Told me she was going to Delhi, not Pakistan': YouTuber Jyoti Malhotra's father makes U-turn",
    "link": "https://timesofindia.indiatimes.com/india/told-me-she-was-going-to-delhi-not-pakistan-youtuber-jyoti-malhotras-father-makes-u-turn/articleshow/121267328.cms",
    "description": "Jyoti Malhotra, a YouTuber, was arrested under the Official Secrets Act for allegedly possessing suspicious material and having ties to Pakistani intelligence. Initially, her father defended her trips to Pakistan, stating she had the necessary permissions for her YouTube work.",
    "pubDate": "2025-05-19T16:01:53+05:30",
    "fetched_at": "2025-05-19T10:35:00.208765+00:00"
  },
  {
    "title": "Delhi Police uncovers 6 fake websites used in cyber fraud",
    "link": "https://timesofindia.indiatimes.com/city/delhi/delhi-police-uncovers-6-fake-websites-used-in-cyber-fraud/articleshow/121267467.cms",
    "description": "Delhi Police have exposed six fraudulent websites designed to deceive individuals, prompting a comprehensive investigation to locate the responsible parties and halt further illicit activities. Authorities are collaborating with the Indian Cyber Crime Coordination Centre (I4C) to cross-verify data, identify potential connections to broader fraud networks, and locate additional victims affected by these platforms.",
    "pubDate": "2025-05-19T15:59:52+05:30",
    "fetched_at": "2025-05-19T10:35:00.208801+00:00"
  },
  {
    "title": "Jannat Zubair rocks a saree look for Tom Cruise’s Mission Impossible premiere in London",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/jannat-zubair-rocks-a-saree-look-for-tom-cruises-mission-impossible-premiere-in-london/articleshow/121267435.cms",
    "description": "Jannat Zubair, the digital sensation, made a striking appearance at the 'Mission Impossible' premiere in London, showcasing a green chiffon saree. Her traditional attire beautifully contrasted with the typical red carpet gowns.",
    "pubDate": "2025-05-19T15:58:25+05:30",
    "fetched_at": "2025-05-19T10:35:00.208805+00:00"
  },
  {
    "title": "8 crore challans issued in '24, Bengaluru rider alone racked up Rs 2.91 lakh in fines: Report",
    "link": "https://timesofindia.indiatimes.com/auto/news/8-crore-challans-issued-in-24-bengaluru-rider-alone-racked-up-rs-2-91-lakh-in-fines-report/articleshow/121266986.cms",
    "description": "A recent Cars24 report reveals a crisis on Indian roads, with a staggering Rs 12,000 crore in traffic fines issued in 2024 alone, and Rs 9,000 crore remaining unpaid. The study highlights that overspeeding is the primary offense, followed by safety violations.",
    "pubDate": "2025-05-19T15:58:12+05:30",
    "fetched_at": "2025-05-19T10:35:00.208808+00:00"
  },
  {
    "title": "Portugal's election brings another minority government and a far-right rise",
    "link": "https://timesofindia.indiatimes.com/world/europe/portugals-election-brings-another-minority-government-and-a-far-right-rise/articleshow/121267333.cms",
    "description": "Portugal's recent election resulted in another minority government led by the center-right Democratic Alliance, while the far-right Chega party made unprecedented gains, mirroring a broader European trend. The outcome reflects political instability and voter desire for change, fueled by concerns over immigration, housing costs, and corruption. Negotiations are expected to be tough to form a stable government.",
    "pubDate": "2025-05-19T15:57:43+05:30",
    "fetched_at": "2025-05-19T10:35:00.208820+00:00"
  },
  {
    "title": "Body of Karnataka woman found dead on private university campus in Punjab to arrive today",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/body-of-karnataka-woman-found-dead-on-private-university-campus-in-punjab-to-arrive-today/articleshow/121266969.cms",
    "description": "Akanksha, a 22-year-old aerospace engineering graduate from Dharmasthala, was found dead at a private university in Punjab. Her family awaits the arrival of her remains, expected late Tuesday or Wednesday, facing delays in the post-mortem and FIR filing. The family seeks a thorough investigation into the circumstances leading to her death, suspecting foul play and language barriers as potential factors.",
    "pubDate": "2025-05-19T15:57:33+05:30",
    "fetched_at": "2025-05-19T10:35:00.208815+00:00"
  },
  {
    "title": "How Malcolm X fought against the 'American nightmare'",
    "link": "https://timesofindia.indiatimes.com/world/us/how-malcolm-x-fought-against-the-american-nightmare/articleshow/121267260.cms",
    "description": "Malcolm X, born into poverty and violence, became a prominent figure in the Nation of Islam, advocating for Black empowerment and self-defense against racial injustice. His pilgrimage to Mecca led to a transformation, embracing a more inclusive vision. Despite his assassination, Malcolm X's legacy continues to resonate, inspiring movements for social justice and equality.",
    "pubDate": "2025-05-19T15:56:35+05:30",
    "fetched_at": "2025-05-19T10:35:00.208811+00:00"
  },
  {
    "title": "Body of Karnataka woman found dead on private university campus in Punjab to arrive today",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/body-of-karnataka-woman-found-dead-on-private-university-campus-in-punjabtoarrivetoday/articleshow/121266969.cms",
    "description": "Akanksha, a 22-year-old aerospace engineering graduate from Dharmasthala, was found dead at a private university in Punjab. Her family awaits the arrival of her remains, expected late Tuesday or Wednesday, facing delays in the post-mortem and FIR filing. The family seeks a thorough investigation into the circumstances leading to her death, suspecting foul play and language barriers as potential factors.",
    "pubDate": "2025-05-19T15:54:48+05:30",
    "fetched_at": "2025-05-19T10:27:58.491213+00:00"
  },
  {
    "title": "Will universe end far earlier than expected?",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/will-universe-end-far-earlier-than-expected/articleshow/121267300.cms",
    "description": "Recent research challenges the long-held belief of an infinitely enduring universe, suggesting it could end much sooner than previously thought. New calculations propose that white dwarfs evaporate over time, shortening the cosmic timeline. Additionally, evidence hints that dark energy might be weakening, potentially leading to a \"Big Crunch\" and an even earlier end.",
    "pubDate": "2025-05-19T15:53:51+05:30",
    "fetched_at": "2025-05-19T10:27:58.491152+00:00"
  },
  {
    "title": "Mangaluru youth dies after KSRTC bus rams scooter on Bengaluru–Mangaluru national highway",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/mangaluru-youth-dies-after-ksrtc-bus-rams-scooter-on-bengalurumangaluru-national-highway/articleshow/121267338.cms",
    "description": "In a tragic incident late Sunday, 24-year-old Alister D’Souza died after a KSRTC bus struck his scooter near Nehru Nagar in Panemangalore. According to police reports, the bus, driven by Shivayya Hiremath, was allegedly overtaking another vehicle when it veered right, hitting D’Souza. Severely injured, D’Souza was rushed to Bantwal Government Hospital, where he was declared dead.",
    "pubDate": "2025-05-19T15:52:32+05:30",
    "fetched_at": "2025-05-19T10:27:58.491193+00:00"
  },
  {
    "title": "Actress Khushbu tells husband Sundar C: I knew you were destined to rule as king of commercial cinema!",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/actress-khushbu-tells-husband-sundar-c-i-knew-you-were-destined-to-rule-as-king-of-commercial-cinema/articleshow/121267179.cms",
    "description": "Congratulating her husband director and actor Sundar C for having completed a phenomenal 30 years in the film industry, actress, producer and politician Khushbu Sundar on Monday penned an adorable post in which she said that she knew deep down that was destined to rule as the King of commercial cinema.",
    "pubDate": "2025-05-19T15:49:10+05:30",
    "fetched_at": "2025-05-19T10:27:58.491205+00:00"
  },
  {
    "title": "Will Meta lawsuits shape Africa's data privacy laws?",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/will-meta-lawsuits-shape-africas-data-privacy-laws/articleshow/121266758.cms",
    "description": "Meta faces mounting legal challenges in Africa, including substantial fines in Nigeria for alleged data privacy violations and discriminatory practices. Content moderators in Ghana are also preparing a lawsuit against a Meta contractor, citing mental health issues due to their work.",
    "pubDate": "2025-05-19T15:47:51+05:30",
    "fetched_at": "2025-05-19T10:27:58.491198+00:00"
  },
  {
    "title": "Giannis Antetokounmpo's surprising choice among NFL teams fuels trade rumors",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/giannis-antetokounmpos-surprising-choice-among-nfl-teams-fuels-trade-rumors/articleshow/121267210.cms",
    "description": "Giannis Antetokounmpo's recent declaration of support for the Dallas Cowboys, alongside his existing Green Bay Packers fandom, has stirred speculation about a potential move to the Dallas Mavericks. This revelation, coupled with upcoming meetings regarding his future with the Milwaukee Bucks, has intensified trade rumors. Fans have reacted with confusion and amusement to his NFL team preferences.",
    "pubDate": "2025-05-19T15:47:24+05:30",
    "fetched_at": "2025-05-19T10:19:56.732246+00:00"
  },
  {
    "title": "Motorcyclist dies after crashing into negligently parked lorry in Karnataka's Puttur",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/motorcyclist-dies-after-crashing-into-negligently-parked-lorry-in-karnatakas-puttur/articleshow/121267255.cms",
    "description": "Sudeesh alias Sudeep tragically died on Sunday night after his motorcycle collided with a negligently parked, unregistered lorry on the Maani–Mysuru National Highway in Puttur. The accident occurred around 9:15 PM when Sudeep crashed into the rear of the lorry, which lacked warning signs. He succumbed to severe injuries sustained from the impact after being transported to the hospital.",
    "pubDate": "2025-05-19T15:47:03+05:30",
    "fetched_at": "2025-05-19T10:19:56.732263+00:00"
  },
  {
    "title": "IPO market gathers momentum: Six firms set to raise over Rs 11,000 crore in May",
    "link": "https://timesofindia.indiatimes.com/business/india-business/ipo-market-news-schloss-bangalore-borana-weaves-belrise-industries-aegis-vopak-terminals-arisinfra-solutions-ipos-worth-rs-11000-crore-in-may/articleshow/121266914.cms",
    "description": "The IPO market is reviving in 2025. Six companies are preparing to launch their IPOs this month. They aim to raise over Rs 11,000 crore. Borana Weaves and Belrise Industries will open their IPOs soon. Schloss Bangalore, Aegis Vopak Terminals, ArisInfra Solutions, and Scoda Tubes are expected to file documents next week. This follows a slowdown earlier in the year.",
    "pubDate": "2025-05-19T15:45:28+05:30",
    "fetched_at": "2025-05-19T10:19:56.732267+00:00"
  },
  {
    "title": "Zoho CEO Sridhar Vembu warns software engineers: AI could wipe out high-paying software jobs-- And what to do",
    "link": "https://timesofindia.indiatimes.com/life-style/relationships/work/zoho-ceo-sridhar-vembu-warns-software-engineers-ai-could-wipe-out-high-paying-software-jobs-and-what-to-do/articleshow/121267194.cms",
    "description": "Zoho's CEO, Sridhar Vembu, cautions software engineers about potential job instability and salary changes due to AI advancements. An IMF report suggests that AI could impact around 40% of jobs globally, with wealthier nations facing a more significant impact.",
    "pubDate": "2025-05-19T15:44:59+05:30",
    "fetched_at": "2025-05-19T10:19:56.732269+00:00"
  },
  {
    "title": "How to use Alum (Fitkari) to remove negative energy",
    "link": "https://timesofindia.indiatimes.com/astrology/vastu-feng-shui/how-to-use-alum-fitkari-to-remove-negative-energy/articleshow/121253371.cms",
    "description": "Alum, commonly found in households, is used for spiritual rituals and possesses therapeutic qualities. It's believed to absorb negative energy, remove bad vibes, and cleanse auras. Traditional methods involve using alum for evil eye removal, placing it under pillows for restful sleep, burning it to cleanse spaces, and using it in baths for energetic purification.",
    "pubDate": "2025-05-19T15:44:20+05:30",
    "fetched_at": "2025-05-19T10:19:56.732272+00:00"
  },
  {
    "title": "When Shatrughan Sinha stated Amitabh Bachchan's stardom was fueled by roles initially meant for him",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/when-shatrughan-sinha-stated-amitabh-bachchans-stardom-was-fueled-by-roles-initially-meant-for-him/articleshow/121266322.cms",
    "description": "Shatrughan Sinha revealed his strained relationship with Amitabh Bachchan. He said Bachchan's superstardom came from roles initially offered to him. Sinha rejected films like 'Sholay' and 'Deewar'. He believes Bachchan became reluctant to work with him. 'Kaala Patthar' worsened their friendship. Sinha suggests Bachchan stopped working with him after that film and 'Dostana' due to his success.",
    "pubDate": "2025-05-19T15:43:58+05:30",
    "fetched_at": "2025-05-19T10:19:56.732274+00:00"
  },
  {
    "title": "Researchers: Extremism in Germany's military remains threat",
    "link": "https://timesofindia.indiatimes.com/world/europe/researchers-extremism-in-germanys-military-remains-threat/articleshow/121267119.cms",
    "description": "A recent study by the Bundeswehr Center reveals that less than 1% of German soldiers hold consistent right-wing extremist views, contrasting with higher rates in the general population. While the report offers some relief amid past scandals involving far-right networks within the military, it also identifies problematic chauvinistic and xenophobic attitudes among soldiers.",
    "pubDate": "2025-05-19T15:43:40+05:30",
    "fetched_at": "2025-05-19T10:19:56.732276+00:00"
  },
  {
    "title": "Second Pakistan spy held in Nuh for leaking Sirsa airbase details",
    "link": "https://timesofindia.indiatimes.com/city/gurgaon/second-pakistani-spy-arrested-in-nuh-for-sharing-sirsa-air-base-details/articleshow/121267127.cms",
    "description": "In Nuh, Haryana, Indian agencies and police apprehended Mohammad Tarif, accused of spying for Pakistan. He allegedly shared sensitive Indian Air Force details for money. Two Pakistan High Commission employees are also booked. Tarif reportedly met them in 2018 and provided information, including location of Sirsa airbase. This is the ninth arrest in the state related to espionage.",
    "pubDate": "2025-05-19T15:43:39+05:30",
    "fetched_at": "2025-05-19T10:19:56.732279+00:00"
  },
  {
    "title": "Trailer of 'Knock Knock...Kaun Hai?' promises a gripping thriller ride",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/trailer-of-knock-knock-kaun-hai-promises-a-gripping-thriller-ride/articleshow/121267013.cms",
    "description": "The upcoming streaming series 'Knock Knock...Kaun Hai?' explores the complexities of young adult relationships and digital temptations. Tanya and Rohan's friendship faces challenges after a betrayal, leading Tanya to a mysterious app with dangerous consequences. Premiering on May 22 on Amazon MX Player, the series delves into the impact of impulsive decisions in a hyper-connected world.",
    "pubDate": "2025-05-19T15:42:59+05:30",
    "fetched_at": "2025-05-19T10:19:56.732284+00:00"
  },
  {
    "title": "Man in Yadavare dies by suicide after family leaves for bengaluru",
    "link": "https://timesofindia.indiatimes.com/city/mysuru/man-in-yadavare-dies-by-suicide-after-family-leaves-for-bengaluru/articleshow/121267121.cms",
    "description": "In Yadavare, Narurman Ashok, known as Madhu, tragically ended his life by shooting himself while alone at home. His wife and daughter were in Bengaluru caring for their ill child, and his mother had also traveled there earlier that day.",
    "pubDate": "2025-05-19T15:41:32+05:30",
    "fetched_at": "2025-05-19T10:19:56.732281+00:00"
  },
  {
    "title": "Can drinking water from copper bottles impact kidneys? Safety tips to follow",
    "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/can-drinking-water-from-copper-bottles-impact-kidneys-safety-tips-to-follow/articleshow/121264983.cms",
    "description": "First things first. Copper as a mineral, though important, is needed by the body in small amounts only. It helps maintain healthy bones, connective tissues, and also supports the immune system. When water is stored in a copper bottle, tiny amounts of copper ions naturally leach into the water. This results in some health benefits such as antibacterial and better digestion.",
    "pubDate": "2025-05-19T15:40:20+05:30",
    "fetched_at": "2025-05-19T10:35:00.208795+00:00"
  },
  {
    "title": "'India can capitalise on this momentum for accelerated manufacturing growth' : S&P Global study",
    "link": "https://timesofindia.indiatimes.com/business/india-business/india-can-capitalise-on-this-momentum-for-accelerated-manufacturing-growth-sp-global-study/articleshow/121266259.cms",
    "description": "A new S&P Global India Research study indicates that India is poised to attract more global manufacturing investment due to evolving trade dynamics. The shift towards local sourcing and regional integration could boost India's manufacturing sector, fostering technological advancement and job creation. Despite a projected GDP slowdown, India's resilience and policy initiatives position it for growth in global manufacturing.",
    "pubDate": "2025-05-19T15:39:23+05:30",
    "fetched_at": "2025-05-19T10:12:33.499185+00:00"
  },
  {
    "title": "'ISI activated them after Pahalgam attack': Police's big charge on arrest of Pakistani spies",
    "link": "https://timesofindia.indiatimes.com/india/isi-activated-them-after-pahalgam-attack-polices-big-charge-on-arrest-of-pakistani-spies/articleshow/121266599.cms",
    "description": "Punjab Police arrested two Pakistani spies. They were in contact with Pakistan's ISI. The spies became active after the Pahalgam terror attack. Authorities transferred one lakh rupees to their accounts. Both individuals are from Gurdaspur and are around 19-20 years old. They are also involved in drug activities. They leaked secret information of security forces to Pakistan.",
    "pubDate": "2025-05-19T15:39:22+05:30",
    "fetched_at": "2025-05-19T10:12:33.499153+00:00"
  },
  {
    "title": "Cannes 2025: Mouni Roy turns heads as she represents Indian cinema on the global stage",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/cannes-2025-mouni-roy-turns-heads-as-she-represents-indian-cinema-on-the-global-stage/articleshow/121266870.cms",
    "description": "Mouni Roy graced the 78th Cannes Film Festival, representing Indian cinema in a stunning Caroline Couture gown. Adorned with Chopard jewels, she captured attention with her elegance and poise. This appearance, her second at Cannes, solidifies her status as a global fashion icon and reflects India's growing influence in international cinema, celebrating her journey from television star to global ambassador.",
    "pubDate": "2025-05-19T15:39:19+05:30",
    "fetched_at": "2025-05-19T10:12:33.499147+00:00"
  },
  {
    "title": "Raashii Khanna tells why she was initially 'not interested' for 'Madras Cafe'",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/raashii-khanna-tells-why-she-was-initially-not-interested-for-madras-cafe/articleshow/121266964.cms",
    "description": "Actress Raashii Khanna revealed on Farah Khan's YouTube show that she initially declined auditioning for her debut film, \"Madras Cafe,\" despite being called thrice. Khanna, who initially aimed to be an IAS officer, mentioned she was hesitant about films and more focused on academics.",
    "pubDate": "2025-05-19T15:38:04+05:30",
    "fetched_at": "2025-05-19T10:12:33.499156+00:00"
  },
  {
    "title": "Congress takes 'sindoor ka sauda' swipe at PM Modi, brings up Trump’s mediation claim",
    "link": "https://timesofindia.indiatimes.com/india/congress-takes-sindoor-ka-sauda-swipe-at-pm-modi-brings-up-trumps-mediation-claim/articleshow/121264579.cms",
    "description": "Congress leader Pawan Khera has criticised the government for allegedly informing Pakistan before strikes on terror infrastructures, questioning the potential security risks. He also attacked PM Modi over Donald Trump's claim of brokering a ceasefire, alleging a secret deal. Rahul Gandhi has also questioned Jaishankar on the same issue, while MEA has refuted the Congress's claims, calling them a misrepresentation of facts.",
    "pubDate": "2025-05-19T15:37:54+05:30",
    "fetched_at": "2025-05-19T10:12:33.499183+00:00"
  },
  {
    "title": "ICRA pegs Q4 GDP growth at 6.9%, sees full-year expansion slowing to 6.3%",
    "link": "https://timesofindia.indiatimes.com/business/india-business/icra-pegs-q4-gdp-growth-at-6-9-sees-full-year-expansion-slowing-to-6-3/articleshow/121265944.cms",
    "description": "ICRA projects India's GDP growth to rise to 6.9% in Q4 FY25, surpassing the previous quarter's 6.2%, but falling short of NSO's 7.6% forecast. Full-year GDP growth is estimated at 6.3%, lower than FY24's 9.2%. The growth is supported by improved industrial sector and stable performance in services and agriculture, despite uneven private consumption and investment trends.",
    "pubDate": "2025-05-19T15:37:17+05:30",
    "fetched_at": "2025-05-19T10:12:33.499180+00:00"
  },
  {
    "title": "Mortal remains of woman who died in Punjab expected to arrive today",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/mortal-remains-of-woman-who-died-in-punjab-expected-to-arrive-today/articleshow/121266969.cms",
    "description": "Akanksha, a 22-year-old aerospace engineering graduate from Dharmasthala, was found dead at a private university in Punjab. Her family awaits the arrival of her remains, expected late Tuesday or Wednesday, facing delays in the post-mortem and FIR filing. The family seeks a thorough investigation into the circumstances leading to her death, suspecting foul play and language barriers as potential factors.",
    "pubDate": "2025-05-19T15:36:54+05:30",
    "fetched_at": "2025-05-19T10:12:33.499155+00:00"
  },
  {
    "title": "DHSE Kerala class 12 result 2025 to be announced on this date: Here's how to check plus two scores on keralaresults.nic.in",
    "link": "https://timesofindia.indiatimes.com/education/news/dhse-kerala-class-12-result-2025-to-be-announced-on-this-date-heres-how-to-check-plus-two-scores-on-keralaresults-nic-in/articleshow/121266548.cms",
    "description": "The Kerala Plus Two Result 2025 will be officially announced on May 22, 2025, at 3:00 PM. The Directorate of Higher Secondary Education (DHSE) has confirmed the release date and time for over 4.44 lakh students. Results can be accessed online using hall ticket number, registration number, and date of birth. The official websites include keralaresults.nic.in, dhsekerala.gov.in, and result.kite.kerala.gov.in. A press conference will also be held to share result highlights and the list of toppers.",
    "pubDate": "2025-05-19T15:36:46+05:30",
    "fetched_at": "2025-05-19T10:12:33.499157+00:00"
  },
  {
    "title": "Paul Greengrass eyes Andrew Garfield to star in historical drama 'The Rage'",
    "link": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/paul-greengrass-eyes-andrew-garfield-to-star-in-historical-drama-the-rage/articleshow/121266810.cms",
    "description": "Andrew Garfield is in talks to star in Paul Greengrass's 'The Rage,' a historical drama about the Peasants' Revolt in 1381. Focus Features is negotiating a domestic distribution deal, with Garfield potentially playing a farmer who leads the uprising. Greengrass's realistic filmmaking style and Garfield's versatility make him a strong fit for the project, produced by Jason Blum's Blumhouse Productions.",
    "pubDate": "2025-05-19T15:36:28+05:30",
    "fetched_at": "2025-05-19T10:12:33.499162+00:00"
  },
  {
    "title": "French state covered up Nestle water scandal: Senate report",
    "link": "https://timesofindia.indiatimes.com/world/europe/french-state-covered-up-nestle-water-scandal-senate-report/articleshow/121266215.cms",
    "description": "The French government \"at the highest level\" covered up a scandal over the treatment of mineral water by food giant Nestle, including the iconic Perrier brand, a Senate investigation said Monday. - 'Highest level of the state' - In late 2020, new management at Nestle Waters claims to have discovered the use of prohibited treatments for mineral water at its Perrier, Hepar and Contrex sites.",
    "pubDate": "2025-05-19T15:36:22+05:30",
    "fetched_at": "2025-05-19T10:12:33.499189+00:00"
  },
  {
    "title": "From AfD to Reform UK: The far right and European politics",
    "link": "https://timesofindia.indiatimes.com/world/europe/from-afd-to-reform-uk-the-far-right-and-european-politics/articleshow/121266749.cms",
    "description": "Germany's intelligence agency labeled the AfD as extremist, sparking a ban debate. Across Europe, far-right parties vary in acceptance. Austria's FPÖ, with Nazi roots, has twice been in government. France's National Rally, led by Marine Le Pen, has softened its image. Italy's Giorgia Meloni, with a complex view of fascism, leads the nation.",
    "pubDate": "2025-05-19T15:35:56+05:30",
    "fetched_at": "2025-05-19T10:12:33.499158+00:00"
  },
  {
    "title": "BCCI secretary Devajit Saikia denies Indian board has decided to pull out of ACC events",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/bcci-secretary-devajit-saikia-denies-indian-board-has-decided-to-pull-out-of-acc-events/articleshow/121266555.cms",
    "description": "BCCI secretary Devajit Saikia refuted reports claiming India's withdrawal from Asian Cricket Council tournaments to isolate Pakistan. Saikia clarified that the BCCI hasn't discussed or decided on participation in the Asia Cup or Women's Emerging Teams Asia Cup. He emphasized the board's current focus on the ongoing IPL and the upcoming England series.",
    "pubDate": "2025-05-19T15:35:51+05:30",
    "fetched_at": "2025-05-19T10:12:33.499168+00:00"
  },
  {
    "title": "Israel's Netanyahu acknowledges pressure from allies in decision to resume Gaza aid",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/israels-netanyahu-acknowledges-pressure-from-allies-in-decision-to-resume-gaza-aid/articleshow/121266688.cms",
    "description": "Israeli Prime Minister Benjamin Netanyahu announced resumption of aid to Gaza following pressure from allies concerned about the worsening humanitarian crisis. The decision comes after a weeks-long blockade that exacerbated the situation, prompting warnings of famine. Despite resuming aid, Israel launched a new offensive, displacing Palestinians and aiming to secure aid distribution while pushing Hamas towards a ceasefire agreement.",
    "pubDate": "2025-05-19T15:35:38+05:30",
    "fetched_at": "2025-05-19T10:12:33.499170+00:00"
  },
  {
    "title": "How to easily obtain the Emperor Sword in Oblivion Remastered?",
    "link": "https://timesofindia.indiatimes.com/sports/esports/news/how-to-easily-obtain-the-emperor-sword-in-oblivion-remastered/articleshow/121266862.cms",
    "description": "In The Elder Scrolls IV: Oblivion Remastered, the players can acquire the Emperor's sword early, exploiting the Lover birthsign's paralysis ability. By provoking Emperor Uriel Septim and using the Lover's Kiss, the players can loot his sword after the scripted collapse of the Emperor. While powerful early on, the sword eventually becomes outclassed, and it serves as a stepping stone in the game.",
    "pubDate": "2025-05-19T15:35:10+05:30",
    "fetched_at": "2025-05-19T10:12:33.499159+00:00"
  },
  {
    "title": "UP transport commissioner orders statewide crackdown on unsafe, overloaded buses",
    "link": "https://timesofindia.indiatimes.com/city/noida/up-transport-commissioner-orders-statewide-crackdown-on-unsafe-overloaded-buses/articleshow/121266890.cms",
    "description": "Following a tragic bus fire near Lucknow that killed five, Uttar Pradesh transport authorities have ordered a statewide crackdown. ARTOs are instructed to inspect buses thoroughly, focusing on safety compliance and adherence to the Bus Body Code. Permits will be cancelled for violations. The Lucknow incident revealed overcrowding and a blocked emergency exit.",
    "pubDate": "2025-05-19T15:34:06+05:30",
    "fetched_at": "2025-05-19T10:12:33.499160+00:00"
  },
  {
    "title": "Rajasthan police arrest fugitive drug trafficker wanted for four years",
    "link": "https://timesofindia.indiatimes.com/city/jaipur/rajasthan-police-arrest-fugitive-drug-trafficker-wanted-for-four-years/articleshow/121266869.cms",
    "description": "Chittorgarh police apprehended Kishan Lal, a 32-year-old drug trafficker, after a four-year manhunt. Lal, carrying a reward of 15,000 rupees, was wanted in multiple drug trafficking cases across Chittorgarh and Hanumangarh districts. Acting on a tip, police caught him at Saran Chauraya as he attempted to flee. He was wanted under the NDPS Act and absconding from Bassi police station.",
    "pubDate": "2025-05-19T15:33:21+05:30",
    "fetched_at": "2025-05-19T10:12:33.499161+00:00"
  },
  {
    "title": "Students told to act as ambassadors to fight dengue in Udupi",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/students-told-to-act-as-ambassadors-to-fight-dengue-in-udupi/articleshow/121266775.cms",
    "description": "Deputy Commissioner Vidya Kumari called on students in Udupi to act as ambassadors in the fight against dengue. She emphasized proactive measures, including community health education, to control the spread of the disease. The focus is on eliminating mosquito breeding sites through the 'Check, Clean, Cover' strategy, promoting a healthier district through collective action.",
    "pubDate": "2025-05-19T15:28:41+05:30",
    "fetched_at": "2025-05-19T10:12:33.499163+00:00"
  },
  {
    "title": "NYT Strands today: Clues, answers, Spangram for May 19, 2025",
    "link": "https://timesofindia.indiatimes.com/technology/gaming/nyt-strands-today-clues-answers-spangram-for-may-19-2025/articleshow/121265003.cms",
    "description": "The New York Times has expanded its puzzle offerings since its first crossword in 1942, introducing games like Wordle and Connections. The latest addition, NYT Strands, challenges players to find theme-related words and a Spangram on a letter grid. Today's Strands puzzle, themed 'Taking the bait,' includes words like TROUT, SALMON, and HALIBUT, with the Spangram being SomethingsFishy.",
    "pubDate": "2025-05-19T15:28:35+05:30",
    "fetched_at": "2025-05-19T10:12:33.499164+00:00"
  },
  {
    "title": "Meet Divya Gopikumar aka Abhirami: The actress making waves after her bold scene with Kamal Haasan in 'Thug Life'",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/meet-divya-gopikumar-aka-abhirami-the-actress-making-waves-after-her-bold-scene-with-kamal-haasan-in-thug-life/articleshow/121266769.cms",
    "description": "Abhirami, also known as Divya Gopikumar, is experiencing a resurgence in popularity following the release of the 'Thug Life' trailer. A scene featuring her and Kamal Haasan has sparked considerable discussion online, overshadowing her previous roles in films like 'Virumaandi'. The film 'Thug Life' is scheduled for release on June 5, 2025.",
    "pubDate": "2025-05-19T15:28:13+05:30",
    "fetched_at": "2025-05-19T10:12:33.499165+00:00"
  },
  {
    "title": "PIL filed in Kolkata over commuting problems caused by teachers' protest outside Bikash Bhavan in Bidhannagar",
    "link": "https://timesofindia.indiatimes.com/city/kolkata/pil-filed-in-kolkata-over-commuting-problems-caused-by-teachers-protest-outside-bikash-bhavan-in-bidhannagar/articleshow/121266740.cms",
    "description": "A PIL has been filed by a Bidhannagar resident citing inconvenience due to the ongoing teachers' protest at Bikash Bhavan, which is obstructing traffic and causing commuting issues. The petitioner seeks designated protest areas to clear the roads. While refusing an urgent hearing, Justice Soumen Sen allowed the case to be filed, questioning if it truly serves public interest.",
    "pubDate": "2025-05-19T15:26:39+05:30",
    "fetched_at": "2025-05-19T10:12:33.499166+00:00"
  },
  {
    "title": "Chhattisgarh HC acquits 2 in electrocution case citing lack of evidence and victim negligence",
    "link": "https://timesofindia.indiatimes.com/city/raipur/chhattisgarh-hc-acquits-2-in-electrocution-case-citing-lack-of-evidence-and-victim-negligence/articleshow/121266730.cms",
    "description": "In a two-decade-old case, the Chhattisgarh High Court overturned a lower court's verdict. Shabbir Khan and Shamim Khan were acquitted in an electrocution case. The court cited a lack of evidence and the deceased's negligence. The deceased, Shahjahan, was electrocuted while connecting a wire. The court emphasized that Shahjahan was not an electrician.",
    "pubDate": "2025-05-19T15:25:56+05:30",
    "fetched_at": "2025-05-19T10:12:33.499167+00:00"
  },
  {
    "title": "Oliver Rowland pulls well ahead of competition in Formula E Driver Standings after Tokyo E-Prix win",
    "link": "https://timesofindia.indiatimes.com/sports/formula-e/oliver-rowland-pulls-well-ahead-of-competition-in-formula-e-driver-standings-after-tokyo-e-prix-win/articleshow/121266690.cms",
    "description": "Oliver Rowland, driving for Nissan, celebrated a momentous victory at the Tokyo E-Prix, marking his fourth win in the 2025 Formula E World Championship. He shared the podium joy with his daughter, charming fans. Rowland's strategic brilliance secured his win, extending his lead in the Driver Standings to a significant 161 points.",
    "pubDate": "2025-05-19T15:24:05+05:30",
    "fetched_at": "2025-05-19T10:12:33.499169+00:00"
  },
  {
    "title": "7 GTA 5 mistakes that Rockstar needs to fix for GTA 6 to succeed",
    "link": "https://timesofindia.indiatimes.com/sports/esports/gta/7-gta-5-mistakes-that-rockstar-needs-to-fix-for-gta-6-to-succeed/articleshow/121266454.cms",
    "description": "GTA 6 is not coming until 2026 so that it can be bigger than GTA5. Issues like the inability to customize avatars, the unrealistic economy, playability of stealth objectives, the physics of cars and vehicles, and cash and character customization after release. Moreover, avoiding pay-to-win plans, actual combat, and the acceleration of a DLC-created world are also essential to sustaining GTA 6's broader impact beyond release.",
    "pubDate": "2025-05-19T15:23:51+05:30",
    "fetched_at": "2025-05-19T10:12:33.499171+00:00"
  },
  {
    "title": "Hong Kong, Singapore see spike in COVID-19 cases: What it means for travellers",
    "link": "https://timesofindia.indiatimes.com/life-style/travel/news/hong-kong-singapore-see-spike-in-covid-19-cases-what-it-means-for-travellers/articleshow/121266373.cms",
    "description": "Several Southeast Asian countries, including Singapore, China, Thailand, and Hong Kong, are experiencing a resurgence of COVID-19 cases. Singapore has reported a significant increase, with dominant strains being 'LF.7' and 'NB.1.8'. Hong Kong faces a fresh wave, impacting mainly the elderly. China's cases are peaking again, while Thailand saw a spike post-Songkran.",
    "pubDate": "2025-05-19T15:23:46+05:30",
    "fetched_at": "2025-05-19T10:12:33.499172+00:00"
  },
  {
    "title": "7 lessons Rockstar can learn from Cyberpunk 2077 to avoid GTA 6 disasters",
    "link": "https://timesofindia.indiatimes.com/sports/esports/gta/7-lessons-rockstar-can-learn-from-cyberpunk-2077-to-avoid-gta-6-disasters/articleshow/121266507.cms",
    "description": "Following the release of GTA 6's Trailer 2, anticipation is high. The article cautions Rockstar to learn from Cyberpunk 2077's troubled launch, emphasizing the need for realistic expectations, console compatibility honesty, and rigorous testing. It stresses the importance of living NPCs, avoiding overpromising features, and ensuring a functional game at launch to meet the world's expectations.",
    "pubDate": "2025-05-19T15:22:46+05:30",
    "fetched_at": "2025-05-19T10:12:33.499172+00:00"
  },
  {
    "title": "Pavithram actress Nayana Josan ties the knot with long-time BFF Gokul",
    "link": "https://timesofindia.indiatimes.com/tv/news/malayalam/pavithram-actress-nayana-josan-ties-the-knot-with-long-time-bff-gokul/articleshow/121266615.cms",
    "description": "TV actress Nayana Josan, celebrated for her role in 'Pavithram,' has married her long-time friend Gokul, a dancer and model, in a traditional ceremony. The wedding, attended by family and celebrities, followed pre-wedding festivities including a bridal shower and a widely admired Christian-themed photoshoot.",
    "pubDate": "2025-05-19T15:22:41+05:30",
    "fetched_at": "2025-05-19T10:12:33.499174+00:00"
  },
  {
    "title": "Meghan Markle's alleged rudeness caused Queen Elizabeth II to have a 'stern words of advice' with her: \"Suddenly, the Queen walked in and said...\"",
    "link": "https://timesofindia.indiatimes.com/entertainment/english/hollywood/news/meghan-markles-alleged-rudeness-caused-queen-elizabeth-ii-to-have-a-stern-words-of-advice-with-her-suddenly-the-queen-walked-in-and-said-/articleshow/121265960.cms",
    "description": "Meghan Markle, the Duchess of Sussex, faced accusations of rudeness towards staff during Queen Elizabeth II's reign. Royal biographer Katie Nicholl recounts an incident where Meghan allegedly criticized a wedding caterer for not serving vegan food, prompting the Queen's intervention. Furthermore, complaints arose from garden staff at Frogmore Cottage regarding Meghan's behavior, leading to further intervention from the late monarch.",
    "pubDate": "2025-05-19T15:18:50+05:30",
    "fetched_at": "2025-05-19T10:12:33.499175+00:00"
  },
  {
    "title": "Bigg Boss 18 fame Shilpa Shirodkar tests positive for COVID-19; Chum Darang says 'Get well soon'",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-18-fame-shilpa-shirodkar-tests-positive-for-covid-19-chum-darang-says-get-well-soon/articleshow/121266413.cms",
    "description": "Shilpa Shirodkar, who recently made a television comeback on Bigg Boss 18, has tested positive for COVID-19, sharing the news on her Instagram and urging fans to stay safe.",
    "pubDate": "2025-05-19T15:17:57+05:30",
    "fetched_at": "2025-05-19T10:12:33.499176+00:00"
  },
  {
    "title": "Nvidia CEO Jensen Huang reveals how students should use AI for career success: ‘How can I use AI to do my job better?’",
    "link": "https://timesofindia.indiatimes.com/technology/tech-news/nvidia-ceo-jensen-huang-reveals-how-students-should-use-ai-for-career-success-how-can-i-use-ai-to-do-my-job-better/articleshow/121266331.cms",
    "description": "Nvidia CEO Jensen Huang emphasises the importance of mastering AI for future career success, highlighting the need to effectively interact with AI tools. He advises aspiring professionals to view AI as an intelligent assistant, stressing the significance of clear and contextual prompts. As AI reshapes industries, understanding and leveraging this technology will be a critical advantage.",
    "pubDate": "2025-05-19T15:17:42+05:30",
    "fetched_at": "2025-05-19T10:12:33.499177+00:00"
  },
  {
    "title": "Jyoti Malhotra's 'link' with the cake delivery at Pakistan High Commission in Delhi that went viral after Pahalgam attack",
    "link": "https://timesofindia.indiatimes.com/technology/social/jyoti-malhotras-link-with-the-cake-delivery-for-pakistan-high-commission-in-delhi-that-went-viral-after-pahalgam-attack/articleshow/121266430.cms",
    "description": "YouTuber Jyoti Malhotra has been arrested in Haryana for allegedly spying for Pakistan. Photos have emerged linking her to a man who delivered a cake to the Pakistan High Commission after the Pahalgam terror attack.",
    "pubDate": "2025-05-19T15:16:24+05:30",
    "fetched_at": "2025-05-19T10:12:33.499181+00:00"
  },
  {
    "title": "Investigation uncovers child exploitation in South Africa’s illegal mines",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/investigation-uncovers-child-exploitation-in-south-africas-illegal-mines/articleshow/121265848.cms",
    "description": "Investigation uncovers child exploitation in South Africa’s illegal mines",
    "pubDate": "2025-05-19T15:16:18+05:30",
    "fetched_at": "2025-05-19T10:12:33.499178+00:00"
  },
  {
    "title": "Neil Nitin Mukesh reveals daughter Nurvi is a big Amitabh Bachchan fan, likes watching 'Sholay' and 'Satte Pe Satta'; deets inside",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/neil-nitin-mukesh-reveals-daughter-nurvi-is-a-big-amitabh-bachchan-fan-likes-watching-sholay-and-satte-pe-satta-deets-inside/articleshow/121266418.cms",
    "description": "Neil Nitin Mukesh shared that his daughter, Nurvi, is developing a love for the arts, enjoying his films and those of Amitabh Bachchan. Nurvi is also exploring hobbies like cycling and skating, inspired by her father's movie 'Lafangey Parindey'. While Neil is selective about the films she watches, Nurvi is showing a keen interest in music, dance, and Kathak.",
    "pubDate": "2025-05-19T15:15:45+05:30",
    "fetched_at": "2025-05-19T10:12:33.499179+00:00"
  },
  {
    "title": "Viewers walk out midway through Jr NTR–Rajamouli classic after 'Yamadonga' 4K re-release",
    "link": "https://timesofindia.indiatimes.com/entertainment/telugu/movies/news/viewers-walk-out-midway-through-jr-ntrrajamouli-classic-after-yamadonga-4k-re-release/articleshow/121266334.cms",
    "description": "SS Rajamouli's 'Yamadonga,' celebrating its 18th anniversary with a 4K re-release, faced a mixed reception, contrasting with its original 2007 success. Despite starring Jr NTR and drawing inspiration from mythology, some viewers reportedly left screenings early. Jr. NTR is now preparing for his Bollywood debut in 'War 2' and a project with director Prashanth Neel.",
    "pubDate": "2025-05-19T15:13:44+05:30",
    "fetched_at": "2025-05-19T10:12:33.499182+00:00"
  },
  {
    "title": "Portugal's election brings another minority government and a far-right rise",
    "link": "https://timesofindia.indiatimes.com/world/europe/portugals-election-brings-another-minority-government-and-a-far-right-rise/articleshow/121266140.cms",
    "description": "Portugal's recent election resulted in another minority government led by the center-right Democratic Alliance, while the populist party Chega made unprecedented gains, mirroring a broader European shift. The Democratic Alliance secured 89 seats but lacks a majority, facing potential instability.",
    "pubDate": "2025-05-19T15:12:41+05:30",
    "fetched_at": "2025-05-19T10:12:33.499196+00:00"
  },
  {
    "title": "Dallas Cowboys set to rule primetime again as NFL builds schedule around ‘America's Team’",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/dallas-cowboys-set-to-rule-primetime-again-as-nfl-builds-schedule-around-americas-team/articleshow/121265925.cms",
    "description": "The Dallas Cowboys will again dominate primetime NFL games. The league is banking on their popularity. The Cowboys' history and large fan base make them a TV ratings magnet. Their games are always special. The team's primetime presence is a deliberate choice by the NFL. The Cowboys are ready to entertain and inspire.",
    "pubDate": "2025-05-19T15:08:49+05:30",
    "fetched_at": "2025-05-19T10:12:33.499185+00:00"
  },
  {
    "title": "Watch: Ravindra Jadeja impresses fans with horse-riding skills",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/watch-ravindra-jadeja-impresses-fans-with-horse-riding-skills/articleshow/121266146.cms",
    "description": "Ravindra Jadeja, the Indian all-rounder, seized a break in the IPL 2025 schedule to indulge his passion for horse riding at his farm. Amidst a challenging IPL season for the Chennai Super Kings, Jadeja found solace in spending time with his horses. He expressed his joy on Instagram, highlighting his long-standing love for horses, which began in 2010.",
    "pubDate": "2025-05-19T15:08:18+05:30",
    "fetched_at": "2025-05-19T10:12:33.499186+00:00"
  },
  {
    "title": "7 problems with GTA Online that Rockstar should avoid in GTA 6",
    "link": "https://timesofindia.indiatimes.com/sports/esports/gta/7-problems-with-gta-online-that-rockstar-should-avoid-in-gta-6/articleshow/121266246.cms",
    "description": "Grand Theft Auto Online has provided players with chaos and fun. As Grand Theft Auto 6 approaches, Rockstar has an opportunity to improve. The article lists toxic lobbies and the endless grind as issues. Shark Cards, outdated menus, and lack of solo content are also problems. Hackers, long load times, and server issues need fixing.",
    "pubDate": "2025-05-19T15:05:39+05:30",
    "fetched_at": "2025-05-19T10:12:33.499187+00:00"
  },
  {
    "title": "Raja Kumari criticizes Cartier for denying the Patiala necklace to Diljit Dosanjh for the Met Gala",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/music/news/raja-kumari-criticizes-cartier-for-denying-the-patiala-necklace-to-diljit-dosanjh-for-the-met-gala/articleshow/121266186.cms",
    "description": "Raja Kumari has criticized Cartier's alleged refusal to lend Diljit Dosanjh the Patiala necklace for the Met Gala, especially after Emma Chamberlain reportedly wore a part of it earlier. Kumari views this as \"performative inclusion,\" highlighting the challenges South Asian artists face in maintaining their cultural identity in the West. She emphasizes the need for authentic representation beyond stereotypes.",
    "pubDate": "2025-05-19T15:03:59+05:30",
    "fetched_at": "2025-05-19T10:12:33.499188+00:00"
  },
  {
    "title": "Donald Trump's NASA budget: Why it may make it difficult to track asteroids approaching Earth",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/donald-trumps-nasa-budget-why-it-may-make-it-difficult-to-track-asteroids-approaching-earth/articleshow/121266069.cms",
    "description": "NASA's planetary defense initiatives, particularly the NEO Surveyor mission designed to detect hazardous asteroids, face potential setbacks due to proposed budget cuts by the Trump administration. These cuts, including a significant reduction to the Science Mission Directorate, threaten to delay or cancel crucial programs.",
    "pubDate": "2025-05-19T15:00:39+05:30",
    "fetched_at": "2025-05-19T10:12:33.499180+00:00"
  },
  {
    "title": "Man held for murdering sister-in-law by setting her on fire in Ludhiana",
    "link": "https://timesofindia.indiatimes.com/city/ludhiana/man-held-for-murdering-sister-in-law-by-setting-her-on-fire-in-ludhiana/articleshow/121266193.cms",
    "description": "Sukhwinderpal Singh has been arrested for allegedly murdering his sister-in-law, Jyoti Kaur, in Kaniya Hussaini village. Initially booked for abetment to suicide, the case was converted to murder after Sukhwinderpal confessed to setting Jyoti on fire with diesel due to her alleged illicit relationship.",
    "pubDate": "2025-05-19T15:00:18+05:30",
    "fetched_at": "2025-05-19T10:12:33.499190+00:00"
  },
  {
    "title": "'We will not give up': Netanyahu says Israel will take control of all territory of Gaza Strip",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/we-will-not-give-up-netanyahu-says-israel-will-take-control-of-all-territory-of-gaza-strip/articleshow/121266170.cms",
    "description": "'We will not give up': Netanyahu says Israel will take control of all territory of Gaza Strip",
    "pubDate": "2025-05-19T14:59:30+05:30",
    "fetched_at": "2025-05-19T10:12:33.499193+00:00"
  },
  {
    "title": "\"This face can stop a crowd,\" Anu Aggarwal recalls the poster frenzy that delayed Amitabh Bachchan",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/this-face-can-stop-a-crowd-anu-aggarwal-recalls-the-poster-frenzy-that-delayed-amitabh-bachchan/articleshow/121266148.cms",
    "description": "Anu Aggarwal, the 'Aashiqui' fame, recently shared the frenzy surrounding her posters, revealing they once caused Amitabh Bachchan to be late for a shoot due to traffic jams. Despite the film's success, she disclosed that she hasn't received her full payment for 'Aashiqui'. However, she holds no resentment, highlighting her successful modeling career and brand endorsements following the film's release.",
    "pubDate": "2025-05-19T14:58:49+05:30",
    "fetched_at": "2025-05-19T10:12:33.499194+00:00"
  },
  {
    "title": "Vishal to tie the knot? Buzz grows over wedding with actress Sai Dhanshika",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/vishal-to-tie-the-knot-buzz-grows-over-wedding-with-actress-sai-dhanshika/articleshow/121265854.cms",
    "description": "Tamil actor Vishal, 47, is reportedly preparing to marry actress Sai Dhanshika, known for 'Madha Gaja Raja.' This news follows Vishal's promise to wed after completing the Nadigar Sangam building, now nearing completion. Sources suggest an engagement is imminent, with a wedding expected in four months, amidst heightened public and media attention following Vishal's recent health scare.",
    "pubDate": "2025-05-19T14:57:17+05:30",
    "fetched_at": "2025-05-19T10:12:33.499195+00:00"
  },
  {
    "title": "5 smart strategies parents should use when their child says 'NO'",
    "link": "https://timesofindia.indiatimes.com/life-style/parenting/moments/5-smart-strategies-parents-should-use-when-their-child-says-no/articleshow/121265962.cms",
    "description": "Many parents face the challenge of children's constant refusal, often stemming from a need for control or independence. Every child says “no” at some point —sometimes often, sometimes loudly. It’s not bad behaviour. It’s growing up. But behind every “no” is a chance to teach responsibility, independence, and emotional control.",
    "pubDate": "2025-05-19T14:56:24+05:30",
    "fetched_at": "2025-05-19T10:12:33.499192+00:00"
  },
  {
    "title": "Rukhsar Rehman was offered Anupamaa before Rupali Ganguly; says 'I was doing OTT, so I had said not now...'",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/rukhsar-rehman-was-offered-anupamaa-before-rupali-ganguly-says-i-was-doing-ott-so-i-had-said-not-now-/articleshow/121265625.cms",
    "description": "Rukhsar Rehman revealed she was offered the lead role in the popular TV show 'Anupamaa' but declined due to prior OTT commitments. She expressed no regrets, attributing it to destiny and believing something else was meant for her.",
    "pubDate": "2025-05-19T14:55:06+05:30",
    "fetched_at": "2025-05-19T10:12:33.499199+00:00"
  },
  {
    "title": "Shibani Bedi’s father passes away; Bollywood stars Bhumi Pednekar and Arjun Kapoor pay tribute",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/shibani-bedis-father-passes-away-bollywood-stars-bhumi-pednekar-and-arjun-kapoor-pay-tribute/articleshow/121266017.cms",
    "description": "Shibani Bedi is mourning the death of her father, Arvind Bedi, expressing profound sadness in a touching online tribute. She shared poignant memories and photos, detailing the emotional experience of scattering his ashes and the intense grief she's been experiencing. Bollywood stars like Bhumi Pednekar and Arjun Kapoor have offered their support and condolences during this difficult time.",
    "pubDate": "2025-05-19T14:52:34+05:30",
    "fetched_at": "2025-05-19T10:12:33.499197+00:00"
  },
  {
    "title": "Israel must prevent Gaza famine for 'diplomatic reasons', PM says",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/israel-must-prevent-gaza-famine-for-diplomatic-reasons-pm-says/articleshow/121265913.cms",
    "description": "Prime Minister Benjamin Netanyahu on Monday said it was necessary for Israel to prevent a famine in Gaza for \"diplomatic reasons\", after his government announced it would allow limited food aid into the territory. \"We must not let the population (of Gaza) sink into famine, both for practical and diplomatic reasons,\" Netanyahu said in a video posted to his Telegram channel, adding that even friends of Israel would not tolerate \"images of mass starvation\".",
    "pubDate": "2025-05-19T14:48:43+05:30",
    "fetched_at": "2025-05-19T10:12:33.499198+00:00"
  },
  {
    "title": "‘Strongest when we work together’: Canadian PM Mark Carney, JD Vance hold talks over tariffs, border security",
    "link": "https://timesofindia.indiatimes.com/world/us/strongest-when-we-work-together-canadian-pm-mark-carney-jd-vance-hold-talks-over-tariffs-border-security/articleshow/121265655.cms",
    "description": "Canadian Prime Minister Mark Carney and US Vice President JD Vance convened in Rome to address trade tensions, border security, and defense cooperation amid ongoing tariff disputes. Both leaders emphasized the importance of collaboration to navigate trade challenges and bolster regional security.",
    "pubDate": "2025-05-19T14:44:10+05:30",
    "fetched_at": "2025-05-19T10:12:33.499200+00:00"
  },
  {
    "title": "BBA student found dead in Manipal hostel room",
    "link": "https://timesofindia.indiatimes.com/city/mangaluru/bba-student-found-dead-in-manipal-hostel-room/articleshow/121265857.cms",
    "description": "Anshul Yadav, a 21-year-old BBA student from Chhattisgarh, was found dead in his hostel room in Manipal. After his parents reported his unresponsiveness, hostel staff discovered his body in a decomposed state, with the door latched from the inside. Police suspect suicide due to academic distress, as Yadav had failed four subjects in his first year.",
    "pubDate": "2025-05-19T14:43:25+05:30",
    "fetched_at": "2025-05-19T10:12:33.499200+00:00"
  },
  {
    "title": "NBA Conference Finals: Final four teams, schedule, and where to watch",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/nba-conference-finals-final-four-teams-schedule-and-where-to-watch/articleshow/121264888.cms",
    "description": "The NBA Conference Finals are set with Indiana Pacers facing the New York Knicks in the East, and Oklahoma City Thunder battling the Minnesota Timberwolves in the West. Both the Pacers and Timberwolves seek their first NBA title. Games will be broadcast on ESPN/ABC for the Western Conference and TNT for the Eastern Conference, with streaming options available.",
    "pubDate": "2025-05-19T14:00:03+05:30",
    "fetched_at": "2025-05-19T11:35:11.985126+00:00"
  },
  {
    "title": "John Cena names his top 3 WWE rivals, sparks buzz ahead of retirement",
    "link": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/john-cena-names-his-top-3-wwe-rivals-sparks-buzz-ahead-of-retirement/articleshow/121264558.cms",
    "description": "John Cena, nearing the end of his WWE career, named The Rock and CM Punk as his most iconic rivals during a fan Q&A. He also acknowledged Randy Orton, comparing their dynamic to classic duos.",
    "pubDate": "2025-05-19T13:42:19+05:30",
    "fetched_at": "2025-05-19T10:43:01.670766+00:00"
  },
  {
    "title": "'He could die in 2 months': Laura Loomer says Joe Biden’s cancer diagnosis confirms her 2024 terminal illness claim",
    "link": "https://timesofindia.indiatimes.com/world/us/he-could-die-in-2-months-laura-loomer-says-joe-bidens-cancer-diagnosis-confirms-her-2024-terminal-illness-claim/articleshow/121261160.cms",
    "description": "Laura Loomer claims Joe Biden's prostate cancer diagnosis validates her previous assertion that he was terminally ill and concealing his health status. She suggests his condition is worsening, leading to the public announcement as a PR move. Despite the diagnosis, experts note that advancements in treatment allow for extended survival, countering Loomer's dire predictions.",
    "pubDate": "2025-05-19T12:35:48+05:30",
    "fetched_at": "2025-05-19T11:35:11.985067+00:00"
  },
  {
    "title": "Which seed is high in protein (no, it is not chia seed)",
    "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/which-seed-is-high-in-protein-no-it-is-not-chia-seed/articleshow/121262610.cms",
    "description": "Move over, chia seeds! This article highlights hemp, pumpkin, sunflower, and sesame seeds as underrated protein powerhouses. These seeds offer significant protein content, essential nutrients, and various health benefits, from muscle recovery to hormone balance. Incorporating them into smoothies, salads, or homemade granola is an easy way to boost your protein intake and overall well-being.",
    "pubDate": "2025-05-19T12:28:38+05:30",
    "fetched_at": "2025-05-19T11:35:11.985095+00:00"
  },
  {
    "title": "Chris Rooney bleeds after stick hits face in Game 7; NHL referee injury raises safety concerns",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/chris-rooney-bleeds-after-stick-hits-face-in-game-7-nhl-referee-injury-raises-safety-concerns/articleshow/121262094.cms",
    "description": "During Game 7 between the Florida Panthers and Toronto Maple Leafs, NHL referee Chris Rooney was struck in the face by a player’s stick, causing a bloody injury and forcing him off the ice. This incident highlights the overlooked risks referees face and raises urgent questions about the NHL’s safety measures for officials in high-pressure playoff games.",
    "pubDate": "2025-05-19T12:16:47+05:30",
    "fetched_at": "2025-05-19T11:10:07.350687+00:00"
  },
  {
    "title": "“They thought wrong” - Fans go crazy as Shai Gilgeous-Alexander slams the MVP debate with his Instagram post",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/they-thought-wrong-fans-go-crazy-as-shai-gilgeous-alexander-slams-the-mvp-debate-with-his-instagram-post/articleshow/121261445.cms",
    "description": "Shai Gilgeous-Alexander led Oklahoma City Thunder to victory. They secured a spot against Minnesota Timberwolves in the Western Conference finals. Alexander's Game 7 performance strengthens his MVP case. He is the second player after Kevin Durant to score 35+ in a Game 7. Fans showed support on Instagram. Thunder will face Nickeil Alexander-Walker and Minnesota Timberwolves in the finals.",
    "pubDate": "2025-05-19T11:23:51+05:30",
    "fetched_at": "2025-05-19T11:10:07.350685+00:00"
  },
  {
    "title": "Are the Saints tanking for Arch Manning? Shannon Sharpe fuels bold quarterback conspiracy theory amid trade buzz",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/are-the-saints-tanking-for-arch-manning-shannon-sharpe-fuels-bold-quarterback-conspiracy-theory-amid-trade-buzz/articleshow/121258379.cms",
    "description": "Amidst trade rumors involving Chris Olave, Shannon Sharpe has sparked debate by suggesting the New Orleans Saints might be strategically tanking to draft Arch Manning in 2026. Sharpe's theory, aired on \"Nightcap,\" links the potential Olave trade to a long-term plan centered on Manning, whose family has deep roots with the Saints.",
    "pubDate": "2025-05-19T11:20:57+05:30",
    "fetched_at": "2025-05-19T11:01:05.654390+00:00"
  },
  {
    "title": "Browns’ crowded quarterback room could force a surprising roster decision soon",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/browns-crowded-quarterback-room-could-force-a-surprising-roster-decision-soon/articleshow/121260893.cms",
    "description": "Cleveland Browns face a quarterback challenge for the 2025 season. Joe Flacco's future with the team is uncertain after the Browns drafted Dillon Gabriel and Shedeur Sanders. Kenny Pickett was also traded to the team. Sanders faces scrutiny but has potential. General Manager Andrew Berry expressed optimism about Sanders. The Browns seem to be prioritizing potential over experience.",
    "pubDate": "2025-05-19T11:14:26+05:30",
    "fetched_at": "2025-05-19T11:18:08.683291+00:00"
  },
  {
    "title": "“It will be very fun” - Shai Gilgeous-Alexander opens up about facing his cousin Nickeil Alexander-Walker in the Western Conference finals",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/it-will-be-very-fun-shai-gilgeous-alexander-opens-up-about-facing-his-cousin-nickeil-alexander-walker-in-the-western-conference-finals/articleshow/121261042.cms",
    "description": "Oklahoma City Thunder triumphed over the Denver Nuggets in Game 7, securing their place in the Western Conference finals against the Minnesota Timberwolves. Shai Gilgeous-Alexander's impressive 35-point performance mirrored Kevin Durant's feat. The upcoming finals are particularly exciting as Shai will face his cousin, Nickeil Alexander-Walker. Shai humorously stated, \"I am trying to take his head off for sure. Completely.\"",
    "pubDate": "2025-05-19T11:05:42+05:30",
    "fetched_at": "2025-05-19T10:35:00.208790+00:00"
  },
  {
    "title": "No-trade clause in Brock Purdy’s deal shows 49ers are building around him—no questions asked",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/no-trade-clause-in-brock-purdys-deal-shows-49ers-are-building-around-himno-questions-asked/articleshow/121259230.cms",
    "description": "The San Francisco 49ers have committed to Brock Purdy with a five-year, $265 million contract extension, including a full no-trade clause. Despite a mixed 2024 season, the team is betting on Purdy to lead them to future success. The deal makes him one of the highest-paid quarterbacks, raising questions about whether the 49ers overpaid for his potential.",
    "pubDate": "2025-05-19T10:51:09+05:30",
    "fetched_at": "2025-05-19T10:43:01.670788+00:00"
  },
  {
    "title": "Into the heart of Ladakh, love, and beauty: The journey people witness with Triyana",
    "link": "https://timesofindia.indiatimes.com/life-style/soul-search/into-the-heart-of-ladakh-love-and-beauty-the-journey-people-witness-with-triyana/articleshow/121252296.cms",
    "description": "Triyana, founded by Monuca Arora, offers immersive travel experiences in Ladakh, focusing on personal connection and cultural understanding rather than typical sightseeing. Inspired by Arora's transformative journey, Triyana provides unique activities like sound meditation and heart-to-heart conversations with locals.",
    "pubDate": "2025-05-18T21:58:17+05:30",
    "fetched_at": "2025-05-19T10:12:33.499191+00:00"
  },
  {
    "title": "Horoscope Tomorrow, May 20, 2025: Your zodiac insights await",
    "link": "https://timesofindia.indiatimes.com/astrology/horoscope/horoscope-tomorrow-may-20-2025-your-zodiac-insights-await/articleshow/121248644.cms",
    "description": "The stars bring a mixed bag, from health and finance to family and travel. While some signs may face financial setbacks or domestic tension, others can expect career boosts and property gains. Academic success requires effort, and travel plans vary, with some advised to stay put while others embark on exciting journeys.",
    "pubDate": "2025-05-18T16:24:50+05:30",
    "fetched_at": "2025-05-19T11:10:07.350683+00:00"
  },
  {
    "title": "Do you wish to improve memory and brain power? Ayurveda prescribes these treatments",
    "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/do-you-wish-to-improve-memory-and-brain-power-ayurveda-prescribes-these-treatments/articleshow/121209175.cms",
    "description": "Ayurveda offers time-tested natural methods to enhance memory and brainpower, crucial in today's fast-paced world. It emphasizes 'Medhya Rasayana,' herbal formulations and lifestyle practices, to correct imbalances causing poor memory. Classical texts, like Charaka Samhita, suggest remedies like 'Brahma Rasayana' and consuming Mandukaparni or Brahmi with milk, under expert guidance, for improved memory and mental clarity.",
    "pubDate": "2025-05-16T16:34:42+05:30",
    "fetched_at": "2025-05-19T11:10:07.350680+00:00"
  }
]