[
  {
    "title": "No one has right over government land, even under Waqf by user: Centre to SC",
    "link": "https://timesofindia.indiatimes.com/india/no-one-has-right-over-government-land-even-under-waqf-by-user-centre-to-sc-bjp-congress-waqf-amendment-act/articleshow/121310205.cms",
    "description": "The Centre asserted in the Supreme Court that government land cannot be claimed by any entity, even if used for religious purposes and classified as waqf. This stance came amidst challenges to the Waqf (Amendment) Act, 2025, with the court examining the power to denotify waqf properties and the composition of waqf boards.",
    "pubDate": "2025-05-21T13:23:34+05:30",
    "fetched_at": "2025-05-21T07:57:21.832181+00:00",
    "id": 1
  },
  {
    "title": "Yeh Rishta Kya Kehlata Hai fame Sandeep Kumaar on exploring the OTT platform says, \"I was always a bad boy on TV screens, here I'm the Hero\"",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/yeh-rishta-kya-kehlata-hai-fame-sandeep-kumaar-on-exploring-the-ott-platform-says-i-was-always-a-bad-boy-on-tv-screens-here-im-the-hero/articleshow/121311317.cms",
    "description": "Sandeep Kumaar, known for his villainous TV roles in shows like 'Tera Mera Saath Rahe,' is now embracing lead roles on OTT platforms. He stars in the upcoming series 'R.I.P Love' as Rohan, a character central to the story.",
    "pubDate": "2025-05-21T13:23:26+05:30",
    "fetched_at": "2025-05-21T07:57:21.832174+00:00",
    "id": 2
  },
  {
    "title": "Sai Sudharsan's power play: Unpacking southpaw's scientific approach to T20 batting",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/sai-sudharsans-power-play-unpacking-southpaws-scientific-approach-to-t20-batting/articleshow/121310652.cms",
    "description": "With 617 runs, Sai Sudharsan is the leading run-scorer in IPL 2025, forging a formidable opening partnership with Shubman Gill for Gujarat Titans. TimesofIndia.com delves deep into how the southpaw worked on his T20 batting with the help of power-hitting coach Shanon Young at the Cricket Performance Lab in Melbourne during the India A tour of Australia in November last year.",
    "pubDate": "2025-05-21T13:19:14+05:30",
    "fetched_at": "2025-05-21T07:57:21.832183+00:00",
    "id": 3
  },
  {
    "title": "Trisha gracefully shuts down criticism for romancing Kamal Haasan in 'Thug Life'",
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/movies/news/trisha-gracefully-shuts-down-criticism-for-romancing-kamal-haasan-in-thug-life/articleshow/121311211.cms",
    "description": "Trisha Krishnan is starring in 'Thug Life' with Kamal Haasan. The film has generated social media discussion. Some critics have pointed out the age difference between Trisha and Kamal. Trisha addressed the criticism at a pre-release event. She spoke about her chemistry with Kamal Haasan. Trisha also praised working with Kamal Haasan and Mani Ratnam.",
    "pubDate": "2025-05-21T13:18:36+05:30",
    "fetched_at": "2025-05-21T07:57:21.832185+00:00",
    "id": 4
  },
  {
    "title": "'It's a diversion': Congress calls Operation Sindoor delegations 'PR exercise'",
    "link": "https://timesofindia.indiatimes.com/india/its-a-diversion-congress-calls-operation-sindoor-delegations-pr-exercise/articleshow/121310434.cms",
    "description": "Congress leader Jairam Ramesh has strongly criticised the government's 'Operation Sindoor' delegation, calling it a diversion from pressing domestic issues like the Pahalgam attack. He questioned PM Modi's absence from crucial all-party meetings and the delay in convening a special parliamentary session to address the security fallout.",
    "pubDate": "2025-05-21T13:18:07+05:30",
    "fetched_at": "2025-05-21T07:57:21.832191+00:00",
    "id": 5
  },
  {
    "title": "NHL playoff controversy: Sergei Bobrovsky responds to controversial hit during Panthers vs Hurricanes Game 1",
    "link": "https://timesofindia.indiatimes.com/sports/nhl/news/nhl-playoff-controversy-sergei-bobrovsky-responds-to-controversial-hit-during-panthers-vs-hurricanes-game-1/articleshow/121311015.cms",
    "description": "In Game 1 of the Eastern Conference Final, Panthers goalie Sergei Bobrovsky stayed composed despite a controversial and dangerous crease collision by Hurricanes’ Andrei Svechnikov. While Bobrovsky dismissed the incident as typical playoff physicality, the hit sparked debate over player safety. With tensions high, Florida’s resilience set the tone for a heated series ahead against Carolina.",
    "pubDate": "2025-05-21T13:13:37+05:30",
    "fetched_at": "2025-05-21T07:47:20.083941+00:00",
    "id": 6
  },
  {
    "title": "Pentagon chief Pete Hegseth orders review of 'chaotic' US withdrawal from Afghanistan",
    "link": "https://timesofindia.indiatimes.com/world/us/pentagon-chief-pete-hegseth-orders-review-of-chaotic-us-withdrawal-from-afghanistan/articleshow/121310602.cms",
    "description": "Defense Secretary Pete Hegseth has ordered a comprehensive review of the 2021 Afghanistan withdrawal, responding to Republican criticisms of the Biden administration's handling of the situation. A special panel will examine previous investigations to ensure accountability and provide a complete picture to the American people regarding the chaotic withdrawal and its consequences, including the Taliban's resurgence.",
    "pubDate": "2025-05-21T13:13:04+05:30",
    "fetched_at": "2025-05-21T07:47:20.083972+00:00",
    "id": 7
  },
  {
    "title": "Seven-day baby among 19 killed in Israeli strike, Hamas claims",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/seven-day-baby-among-19-killed-in-israeli-strike-hamas-claims/articleshow/121309938.cms",
    "description": "Israeli strikes in Gaza have resulted in at least 19 fatalities, including a baby, according to the Hamas-controlled civil defense agency. This escalation follows Israel's announcement to take control of the Gaza Strip and the breakdown of ceasefire negotiations in Doha, with both sides blaming each other for the failure.",
    "pubDate": "2025-05-21T13:12:16+05:30",
    "fetched_at": "2025-05-21T07:47:20.083979+00:00",
    "id": 8
  },
  {
    "title": "Mumbai cooperative department officer caught taking Rs 2 lakh bribe, arrested by ACB in Bandra",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/mumbai-cooperative-department-officer-caught-taking-rs-2-lakh-bribe-arrested-by-acb-in-bandra/articleshow/121310975.cms",
    "description": "Vikas Ramchandra Korde, a Cooperative Officer, was apprehended by the Anti Corruption Bureau while accepting a bribe of Rs 2 lakhs. The bribe was solicited to expedite action on a complaint filed by a housing society treasurer regarding alleged illegal activities by committee members. The ACB has registered a case, and further investigation is underway to identify other involved officials.",
    "pubDate": "2025-05-21T13:12:11+05:30",
    "fetched_at": "2025-05-21T07:47:20.083985+00:00",
    "id": 9
  },
  {
    "title": "Jagannath Temple in Odisha's Puri without governing body for 8 months",
    "link": "https://timesofindia.indiatimes.com/city/bhubaneswar/jagannath-temple-in-odishas-puri-without-governing-body-for-8-months/articleshow/121310669.cms",
    "description": "The Jagannath Temple in Puri has been without its managing committee for eight months, impacting key decisions on the 2025-26 budget, a new darshan system, and Hundi repositioning. With the Rath Yatra approaching, the absence of the committee poses challenges in finalizing rituals and arrangements.",
    "pubDate": "2025-05-21T13:12:05+05:30",
    "fetched_at": "2025-05-21T07:47:20.084015+00:00",
    "id": 10
  },
  {
    "title": "PM Narendra Modi to inaugurate five redeveloped Chhattisgarh railway stations under Amrit Bharat Station Scheme",
    "link": "https://timesofindia.indiatimes.com/city/raipur/pm-narendra-modi-to-inaugurate-five-redeveloped-chhattisgarh-railway-stations-under-amrit-bharat-station-scheme/articleshow/121310333.cms",
    "description": "Prime Minister Narendra Modi is set to inaugurate five redeveloped railway stations in Chhattisgarh, including Dongargarh and Ambikapur, via video conferencing. This initiative is part of the Amrit Bharat Station Scheme, a nationwide project modernizing 98 stations. Chhattisgarh has 32 stations selected for upgrades costing ₹1,680 crore, focusing on modern amenities, infrastructure development, and promoting local culture and connectivity.",
    "pubDate": "2025-05-21T13:09:38+05:30",
    "fetched_at": "2025-05-21T07:47:20.083990+00:00",
    "id": 11
  },
  {
    "title": "Logan Paul eyes WWE glory amid fan backlash, JBL predicts big future",
    "link": "https://timesofindia.indiatimes.com/sports/wwe/top-stories/logan-paul-eyes-wwe-glory-amid-fan-backlash-jbl-predicts-big-future/articleshow/121310747.cms",
    "description": "Logan Paul, amidst preparing for a title clash with Jey Uso at Saturday Night’s Main Event, has ignited controversy by dismissing fan criticism as \"forced.\" Despite the division, WWE Hall of Famer JBL predicts Paul will become a world champion in the future, acknowledging Uso's current momentum. Paul remains a prominent figure in WWE, determined to prove his worth.",
    "pubDate": "2025-05-21T13:07:46+05:30",
    "fetched_at": "2025-05-21T07:47:20.084000+00:00",
    "id": 12
  },
  {
    "title": "IPL playoffs scenarios: With 8 games remaining, MI have 6.3% chance of making top two — odds for each team explained",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/ipl/top-stories/ipl-playoffs-scenarios-with-8-games-remaining-mi-have-6-3-chance-of-making-top-two-odds-for-each-team-explained/articleshow/121310092.cms",
    "description": "With 8 games remaining in the league stage, CSK, RR, SRH, KKR and LSG are already out of contention for the playoffs. GT, RCB and PBKS are sure to make the playoffs, while MI and DC contend for a spot with tonight's match between them a must-win for DC. There remain 256 possible combinations of results, so nothing is for sure yet in terms of who finishes where at the end of the league. We look at the probabilities:",
    "pubDate": "2025-05-21T13:07:42+05:30",
    "fetched_at": "2025-05-21T07:47:20.083995+00:00",
    "id": 13
  },
  {
    "title": "Woman feels vibrations near fan and washing machine; doctor links it to a common deficiency",
    "link": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/woman-feels-vibrations-near-fan-and-washing-machines-doctor-links-it-to-a-common-deficiency/articleshow/121310960.cms",
    "description": "An Indian doctor recently shared the peculiar case of a 40-year-old woman experiencing vibrations near electrical appliances. After multiple misdiagnoses, tests revealed vitamin B12 and iron deficiencies as the root cause. These deficiencies can trigger nerve issues and restless legs syndrome, leading to unusual sensations. The proximity to appliances acted as a psychological trigger, amplifying her symptoms.",
    "pubDate": "2025-05-21T13:07:22+05:30",
    "fetched_at": "2025-05-21T07:39:18.799895+00:00",
    "id": 14
  },
  {
    "title": "Google Play Store’s new features and subscription tools unveiled at Google I/O 2025",
    "link": "https://timesofindia.indiatimes.com/technology/tech-news/google-play-stores-new-features-and-subscription-tools-unveiled-at-google-i/o-2025/articleshow/121310948.cms",
    "description": "Google Play Store is set to receive significant upgrades, as announced at Google I/O 2025. New 'topic browse pages' will enhance content discovery, starting with Media & Entertainment in the U.S. Audio previews are being introduced for apps, initially for Health & Wellness apps.",
    "pubDate": "2025-05-21T13:06:41+05:30",
    "fetched_at": "2025-05-21T07:39:18.799910+00:00",
    "id": 15
  },
  {
    "title": "Drone-like objects spotted over Kolkata sky, police probe espionage angle",
    "link": "https://timesofindia.indiatimes.com/city/kolkata/drone-like-objects-spotted-over-kolkata-sky-police-probe-espionage-angle/articleshow/121310503.cms",
    "description": "Kolkata police are investigating unidentified drone-like objects spotted hovering over key areas, including Hastings, Vidyasagar Setu, and Maidan, on Monday night. Originating from Maheshtala, South 24 Parganas, the objects also flew over Fort William and Park Circus before disappearing.",
    "pubDate": "2025-05-21T13:03:25+05:30",
    "fetched_at": "2025-05-21T07:39:18.799914+00:00",
    "id": 16
  },
  {
    "title": "Why You Should Not Cross a Chauraha in the Evening",
    "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/why-you-should-not-cross-a-chauraha-in-the-evening/articleshow/121309670.cms",
    "description": "Ancient Indian beliefs consider crossroads ('Chauraha') as convergence points of energies, both positive and negative, especially potent at night. Tradition warns against crossing them after dusk due to increased spiritual activity and potential exposure to wandering spirits. Ritual offerings left at these junctions can also negatively impact those who disturb them.",
    "pubDate": "2025-05-21T13:00:33+05:30",
    "fetched_at": "2025-05-21T07:39:18.799916+00:00",
    "id": 17
  },
  {
    "title": "UP govt to revamp religious routes with Rs 4,560 crore investment",
    "link": "https://timesofindia.indiatimes.com/india/up-govt-to-revamp-religious-routes-with-rs-4560-crore-investment/articleshow/121310715.cms",
    "description": "The Uttar Pradesh government is set to invest Rs 4,560 crore in upgrading roads connecting key religious sites, aiming to boost religious tourism and improve pilgrim travel. This initiative focuses on enhancing connectivity to destinations like Ayodhya, Varanasi, and Mathura. The project includes widening roads, improving safety, and beautifying routes, with 272 projects planned for completion by 2025-26.",
    "pubDate": "2025-05-21T12:59:56+05:30",
    "fetched_at": "2025-05-21T07:39:18.799921+00:00",
    "id": 18
  },
  {
    "title": "'Has she committed murder?' Supreme Court grants anticipatory bail to Puja Khedkar in IAS fraud case",
    "link": "https://timesofindia.indiatimes.com/india/has-she-committed-murder-supreme-court-grants-anticipatory-bail-to-puja-khedkar-in-ias-fraud-case/articleshow/121305225.cms",
    "description": "The Supreme Court granted anticipatory bail to former IAS probationer Puja Khedkar, accused of cheating in the civil services exam by falsely claiming OBC and disability reservation benefits. The Delhi Police and UPSC opposed the bail, alleging fraud. Khedkar faces accusations of submitting false certificates and using different names to bypass exam rules.",
    "pubDate": "2025-05-21T12:58:51+05:30",
    "fetched_at": "2025-05-21T07:30:43.669862+00:00",
    "id": 19
  },
  {
    "title": "Rihanna and her baby bump set new standard for maternity glam at Cannes 2025",
    "link": "https://timesofindia.indiatimes.com/life-style/fashion/celeb-style/rihanna-and-her-baby-bump-set-new-standard-for-maternity-glam-at-cannes-2025/articleshow/121310526.cms",
    "description": "Rihanna, expecting her third child, redefined maternity style at the Cannes Film Festival. She graced the premiere of A$AP Rocky's film in a custom Alaïa gown, showcasing daring cutouts and a thigh-high slit. Her radiant appearance, complemented by Boucheron jewels and a glamorous updo, proved that pregnancy and high fashion can coexist, inspiring expectant mothers to embrace bold style.",
    "pubDate": "2025-05-21T12:57:00+05:30",
    "fetched_at": "2025-05-21T07:30:43.669846+00:00",
    "id": 20
  },
  {
    "title": "Cannes 2025 screening: 'Aranyer Din Ratri' receives standing ovation",
    "link": "https://timesofindia.indiatimes.com/entertainment/bengali/movies/news/cannes-2025-screening-aranyer-din-ratri-receives-standing-ovation/articleshow/121310561.cms",
    "description": "Satyajit Ray's \"Aranyer Din Ratri,\" in its newly 4K restored version, captivated audiences at the 2025 Cannes Film Festival, earning a standing ovation. The screening, part of the Cannes Classics section, was attended by veteran actors Sharmila Tagore and Simi Garewal. Wes Anderson, a long-time admirer of Ray, presented the film, which was restored through a collaborative effort led by Martin Scorsese's The Film Foundation.",
    "pubDate": "2025-05-21T12:56:28+05:30",
    "fetched_at": "2025-05-21T07:30:43.669868+00:00",
    "id": 21
  },
  {
    "title": "TNPSC Combined Technical Services Recruitment 2025: Notification for 615 vacancies released, application begins on this date",
    "link": "https://timesofindia.indiatimes.com/education/news/tnpsc-combined-technical-services-recruitment-2025-notification-for-615-vacancies-released-application-begins-on-this-date/articleshow/121310720.cms",
    "description": "The Tamil Nadu Public Service Commission has announced the Combined Technical Services recruitment for 2025, aiming to fill 615 vacancies across 47 posts in various government departments. Online applications will be accepted from May 27 to June 25, 2025, through the official website, tnpsc.gov.in. Eligible candidates with relevant engineering degrees can apply for positions like Assistant Engineer and Computer Programmer.",
    "pubDate": "2025-05-21T12:55:32+05:30",
    "fetched_at": "2025-05-21T07:30:43.669866+00:00",
    "id": 22
  },
  {
    "title": "Top Maoist leader Nambala Keshavrao among 26 gunned down in Chhattisgarh encounter",
    "link": "https://timesofindia.indiatimes.com/city/hyderabad/top-maoist-leader-nambala-keshavrao-among-26-gunned-down-in-chhattisgarhencounter/articleshow/121309698.cms",
    "description": "In a significant blow to the CPI (Maoist), over 26 Maoists were killed in a fierce encounter with security forces in Chhattisgarh's Narayanpur district. The operation, part of Operation Kagar, resulted in the reported death of top leader Nambala Keshavrao, alias Basavaraj, along with other key figures. This loss could severely impact the insurgent group's leadership and ability to reorganize.",
    "pubDate": "2025-05-21T12:53:51+05:30",
    "fetched_at": "2025-05-21T07:37:18.549030+00:00",
    "id": 23
  },
  {
    "title": "Australian chopper crash caused by pilot disorientation: report",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/australian-chopper-crash-caused-by-pilot-disorientation-report/articleshow/121310156.cms",
    "description": "A recent report revealed that the Australian military helicopter crash in July 2023, which killed four crew members, was caused by the pilots' spatial disorientation. The MRH-90 Taipan plunged into the sea near the Whitsunday Islands during the Talisman Sabre exercise. Investigators found the pilots lost visual sight of other aircraft, leading to an unrecognised climb and subsequent crash.",
    "pubDate": "2025-05-21T12:52:46+05:30",
    "fetched_at": "2025-05-21T07:30:43.669882+00:00",
    "id": 24
  },
  {
    "title": "Young chess talents shine at Chhattisgarh U-13 state championship",
    "link": "https://timesofindia.indiatimes.com/city/raipur/young-chess-talents-shine-at-chhattisgarh-u-13-state-championship/articleshow/121310407.cms",
    "description": "Shilp Kumar Ghodeshwar and Pratishtha Ahirwar triumphed in the Chhattisgarh State Under-13 FIDE Rated Chess Championship, winning the Open (Boys) and Girls categories, respectively. The competition featured 126 players from 20 districts, including 20 internationally rated participants. Shilp, Abhinav Singh Rajput, Pratishtha, and Ishika Madke have been selected for the national competition.",
    "pubDate": "2025-05-21T12:50:20+05:30",
    "fetched_at": "2025-05-21T07:21:41.459013+00:00",
    "id": 25
  },
  {
    "title": "Mysterious headless, tailless alligator found floating in Cape Coral canal sparks fear among Florida residents",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/mysterious-headless-tailless-alligator-found-floating-in-cape-coral-canal-sparks-fear-among-florida-residents/articleshow/121310458.cms",
    "description": "A headless, tail-less alligator discovered in Cape Coral, Florida, has sparked a poaching investigation. Resident Gloria Baenen found the mutilated carcass near her boat, prompting concern among locals and wildlife officials. The Florida Fish and Wildlife Conservation Commission is investigating, highlighting strict hunting regulations and raising fears about illegal poaching activities threatening Florida's alligator population.",
    "pubDate": "2025-05-21T12:49:23+05:30",
    "fetched_at": "2025-05-21T07:21:41.459037+00:00",
    "id": 26
  },
  {
    "title": "Mouse droppings discovered in luxury suites at Old Trafford on eve of Europa League final",
    "link": "https://timesofindia.indiatimes.com/sports/football/news/mouse-droppings-discovered-in-luxury-suites-at-old-trafford-on-eve-of-europa-league-final/articleshow/121310498.cms",
    "description": "Manchester United faces renewed scrutiny as mouse droppings were discovered in Old Trafford's premium dining areas just before the Europa League final. This discovery raises concerns about hygiene standards, especially given the stadium's existing two-star food hygiene rating. The club is addressing the issue, but the incident highlights the challenges of maintaining cleanliness in the aging stadium.",
    "pubDate": "2025-05-21T12:48:12+05:30",
    "fetched_at": "2025-05-21T07:21:41.459044+00:00",
    "id": 27
  },
  {
    "title": "South Korean exports dip as US tariffs take toll, government unveils $20.5 billion aid plan for businesses",
    "link": "https://timesofindia.indiatimes.com/business/international-business/south-korean-exports-dip-as-us-tariffs-take-toll-government-unveils-20-5-billion-aid-plan-for-businesses/articleshow/121310268.cms",
    "description": "South Korea's exports experienced a 2.4% year-on-year decline in the first 20 days of May, primarily due to decreased sales to major trade partners, including a significant drop in exports to the United States following tariff impositions.",
    "pubDate": "2025-05-21T12:48:05+05:30",
    "fetched_at": "2025-05-21T07:21:41.459041+00:00",
    "id": 28
  },
  {
    "title": "'Dog whistling': Supreme Court slams Ashoka University professor Ali Khan Mahmudabad's choice of words, grants him interim bail",
    "link": "https://timesofindia.indiatimes.com/india/dog-whistling-supreme-court-slams-ashoka-university-professor-ali-khan-mahmudabads-choice-of-words-grants-him-interim-bail/articleshow/121309823.cms",
    "description": "The Supreme Court granted interim bail to Ashoka University professor Ali Khan Mahmudabad, who was arrested for social media posts concerning Operation Sindoor. The court has ordered the formation of a Special Investigation Team (SIT) to investigate the case. Mahmudabad faces charges under the Bharatiya Nyaya Sanhita, including endangering national integrity, following complaints about his remarks.",
    "pubDate": "2025-05-21T12:46:51+05:30",
    "fetched_at": "2025-05-21T07:37:18.549029+00:00",
    "id": 29
  },
  {
    "title": "No Princess Diaries for Gavi! Barcelona star chooses Ana Pelayo over royal romance — meet his new leading lady",
    "link": "https://www.indiatimes.com/trending/no-princess-diaries-for-gavi-barcelona-star-chooses-ana-pelayo-over-royal-romance-meet-his-new-leading-lady-659323.html",
    "description": "No Princess Diaries for Gavi! Barcelona star chooses Ana Pelayo over royal romance — meet his new leading lady",
    "pubDate": "2025-05-21T12:46:14+05:30",
    "fetched_at": "2025-05-21T07:21:41.459047+00:00",
    "id": 30
  }
]